{
  "selectedFiles": [],
  "selectedURLs": [
    [
      "url:1731224303522",
      "https://google.github.io/styleguide/jsguide.html"
    ]
  ],
  "selectedNotes": [],
  "selectedSpecials": [],
  "outputContents": [
    [
      "url:1731224303522",
      "Fetched content from https://google.github.io/styleguide/jsguide.html on 2024-11-10 07:38:23\n\n\n\n\n\nPlease note: This guide is no longer being updated. Google recommends migrating\nto TypeScript, and following the TypeScript guide.\n\n\n1 Introduction\n\nThis document serves as the complete definition of Google’s coding standards\nfor source code in the JavaScript programming language. A JavaScript source file\nis described as being in Google Style if and only if it adheres to the rules\nherein.\n\nLike other programming style guides, the issues covered span not only aesthetic\nissues of formatting, but other types of conventions or coding standards as\nwell. However, this document focuses primarily on the hard-and-fast rules that\nwe follow universally, and avoids giving advice that isn't clearly enforceable\n(whether by human or tool).\n\n1.1 Terminology notes\n\nIn this document, unless otherwise clarified:\n\n\nThe term comment always refers to implementation comments. We do not use\nthe phrase documentation comments, instead using the common term “JSDoc”\nfor both human-readable text and machine-readable annotations within /** …\n*/.\nThis Style Guide uses RFC 2119 terminology when using the phrases must,\nmust not, should, should not, and may. The terms prefer and\navoid correspond to should and should not, respectively. Imperative\nand declarative statements are prescriptive and correspond to must.\n\n\nOther terminology notes will appear occasionally throughout the document.\n\n1.2 Guide notes\n\nExample code in this document is non-normative. That is, while the examples\nare in Google Style, they may not illustrate the only stylish way to represent\nthe code. Optional formatting choices made in examples must not be enforced as\nrules.\n\n2 Source file basics\n\n2.1 File name\n\nFile names must be all lowercase and may include underscores (_) or dashes\n(-), but no additional punctuation. Follow the convention that your project\nuses. Filenames’ extension must be .js.\n\n2.2 File encoding: UTF-8\n\nSource files are encoded in UTF-8.\n\n2.3 Special characters\n\n2.3.1 Whitespace characters\n\nAside from the line terminator sequence, the ASCII horizontal space character\n(0x20) is the only whitespace character that appears anywhere in a source file.\nThis implies that\n\n\nAll other whitespace characters in string literals are escaped, and\nTab characters are not used for indentation.\n\n\n2.3.2 Special escape sequences\n\nFor any character that has a special escape sequence (\\', \\\", \\\\, \\b,\n\\f, \\n, \\r, \\t, \\v), that sequence is used rather than the\ncorresponding numeric escape (e.g \\x0a, \\u000a, or \\u{a}). Legacy octal\nescapes are never used.\n\n2.3.3 Non-ASCII characters\n\nFor the remaining non-ASCII characters, either the actual Unicode character\n(e.g. ∞) or the equivalent hex or Unicode escape (e.g. \\u221e) is used,\ndepending only on which makes the code easier to read and understand.\n\nTip: In the Unicode escape case, and occasionally even when actual Unicode\ncharacters are used, an explanatory comment can be very helpful.\n\n/* Best: perfectly clear even without a comment. */\nconst units = 'μs';\n\n/* Allowed: but unnecessary as μ is a printable character. */\nconst units = '\\u03bcs'; // 'μs'\n\n/* Good: use escapes for non-printable characters with a comment for clarity. */\nreturn '\\ufeff' + content;  // Prepend a byte order mark.\n\n\n/* Poor: the reader has no idea what character this is. */\nconst units = '\\u03bcs';\n\n\nTip: Never make your code less readable simply out of fear that some programs\nmight not handle non-ASCII characters properly. If that happens, those programs\nare broken and they must be fixed.\n\n3 Source file structure\n\nAll new source files should either be a goog.module\nfile (a file containing a goog.module call) or an ECMAScript (ES) module (uses\nimport and export statements).\n\nFiles consist of the following, in order:\n\n\nLicense or copyright information, if present\n@fileoverview JSDoc, if present\ngoog.module statement, if a goog.module file\nES import statements, if an ES module\ngoog.require and goog.requireType statements\nThe file’s implementation\n\n\nExactly one blank line separates each section that is present, except the\nfile's implementation, which may be preceded by 1 or 2 blank lines.\n\n3.1 License or copyright information, if present\n\nIf license or copyright information belongs in a file, it belongs here.\n\n3.2 @fileoverview JSDoc, if present\n\nSee ?? for formatting rules.\n\n3.3 goog.module statement\n\nAll goog.module files must declare exactly one goog.module name on a single\nline: lines containing a goog.module declaration must not be wrapped, and are\ntherefore an exception to the 80-column limit.\n\nThe entire argument to goog.module is what defines a namespace. It is the\npackage name (an identifier that reflects the fragment of the directory\nstructure where the code lives) plus, optionally, the main class/enum/interface\nthat it defines concatenated to the end in lowerCamelCase.\n\nExample:\n\ngoog.module('search.urlHistory.urlHistoryService');\n\n\n3.3.1 Hierarchy\n\nModule namespaces may never be named as a direct child of another module's\nnamespace.\n\nDisallowed:\n\ngoog.module('foo.bar');   // 'foo.bar.qux' would be fine, though\ngoog.module('foo.bar.baz');\n\n\nThe directory hierarchy reflects the namespace hierarchy, so that deeper-nested\nchildren are subdirectories of higher-level parent directories. Note that this\nimplies that owners of “parent” namespace groups are necessarily aware of all\nchild namespaces, since they exist in the same directory.\n\n3.3.2 goog.module.declareLegacyNamespace\n\nThe single goog.module statement may optionally be followed by a call to\ngoog.module.declareLegacyNamespace();. Avoid\ngoog.module.declareLegacyNamespace() when possible.\n\nExample:\n\ngoog.module('my.test.helpers');\ngoog.module.declareLegacyNamespace();\ngoog.setTestOnly();\n\n\ngoog.module.declareLegacyNamespace exists to ease the transition from\ntraditional object hierarchy-based namespaces but comes with some naming\nrestrictions. As the child module name must be created after the parent\nnamespace, this name must not be a child or parent of any other\ngoog.module (for example, goog.module('parent'); and\ngoog.module('parent.child'); cannot both exist safely, nor can\ngoog.module('parent'); and goog.module('parent.child.grandchild');).\n\n3.3.3 goog.module Exports\n\nClasses, enums, functions, constants, and other symbols are exported using the\nexports object. Exported symbols may be defined directly on the exports\nobject, or else declared locally and exported separately. Symbols are only\nexported if they are meant to be used outside the module. Non-exported\nmodule-local symbols are not declared @private. There is no prescribed\nordering for exported and module-local symbols.\n\nExamples:\n\nconst /** !Array<number> */ exportedArray = [1, 2, 3];\n\nconst /** !Array<number> */ moduleLocalArray = [4, 5, 6];\n\n/** @return {number} */\nfunction moduleLocalFunction() {\n  return moduleLocalArray.length;\n}\n\n/** @return {number} */\nfunction exportedFunction() {\n  return moduleLocalFunction() * 2;\n}\n\nexports = {exportedArray, exportedFunction};\n\n\n/** @const {number} */\nexports.CONSTANT_ONE = 1;\n\n/** @const {string} */\nexports.CONSTANT_TWO = 'Another constant';\n\n\nDo not annotate the exports object as @const as it is already treated as a\nconstant by the compiler.\n\n/** @const */\nexports = {exportedFunction};\n\n\nDo not use default exports as they don't translate easily to ES module\nsemantics.\n\nexports = FancyClass;\n\n\n\n\n3.4 ES modules\n\nES modules are files that use the import and export keywords.\n\n\n\n3.4.1 Imports\n\nImport statements must not be line wrapped and are therefore an exception to the\n80-column limit.\n\n\n\n3.4.1.1 Import paths\n\nES module files must use the import statement to import other ES module\nfiles. Do not goog.require another ES module.\n\nimport './sideeffects.js';\n\nimport * as goog from '../closure/goog/goog.js';\nimport * as parent from '../parent.js';\n\nimport {name} from './sibling.js';\n\n\n\n\n3.4.1.1.1 File extensions in import paths\n\nThe .js file extension is not optional in import paths and must always be\nincluded.\n\nimport '../directory/file';\n\n\nimport '../directory/file.js';\n\n\n3.4.1.2 Importing the same file multiple times\n\nDo not import the same file multiple times. This can make it hard to determine\nthe aggregate imports of a file.\n\n// Imports have the same path, but since it doesn't align it can be hard to see.\nimport {short} from './long/path/to/a/file.js';\nimport {aLongNameThatBreaksAlignment} from './long/path/to/a/file.js';\n\n\n\n\n3.4.1.3 Naming imports\n\n3.4.1.3.1 Naming module imports\n\nModule import names (import * as name) are lowerCamelCase names that are\nderived from the imported file name.\n\nimport * as fileOne from '../file-one.js';\nimport * as fileTwo from '../file_two.js';\nimport * as fileThree from '../filethree.js';\n\n\nimport * as libString from './lib/string.js';\nimport * as math from './math/math.js';\nimport * as vectorMath from './vector/math.js';\n\n\nSome libraries might commonly use a namespace import prefix that violates this\nnaming scheme, but overbearingly common open source use makes the violating\nstyle more readable. The only library that currently falls under this exception\nis threejs, using the THREE prefix.\n\n3.4.1.3.2 Naming default imports\n\nDefault import names are derived from the imported file name and follow the\nrules in ??.\n\nimport MyClass from '../my-class.js';\nimport myFunction from '../my_function.js';\nimport SOME_CONSTANT from '../someconstant.js';\n\n\nNote: In general this should not happen as default exports are banned by this\nstyle guide, see ??. Default imports are only used\nto import modules that do not conform to this style guide.\n\n3.4.1.3.3 Naming named imports\n\nIn general symbols imported via the named import (import {name}) should keep\nthe same name. Avoid aliasing imports (import {SomeThing as SomeOtherThing}).\nPrefer fixing name collisions by using a module import (import *) or renaming\nthe exports themselves.\n\nimport * as bigAnimals from './biganimals.js';\nimport * as domesticatedAnimals from './domesticatedanimals.js';\n\nnew bigAnimals.Cat();\nnew domesticatedAnimals.Cat();\n\n\nIf renaming a named import is needed then use components of the imported\nmodule's file name or path in the resulting alias.\n\nimport {Cat as BigCat} from './biganimals.js';\nimport {Cat as DomesticatedCat} from './domesticatedanimals.js';\n\nnew BigCat();\nnew DomesticatedCat();\n\n\n\n\n3.4.2 Exports\n\nSymbols are only exported if they are meant to be used outside the module.\nNon-exported module-local symbols are not declared @private. There is no\nprescribed ordering for exported and module-local symbols.\n\n3.4.2.1 Named vs default exports\n\nUse named exports in all code. You can apply the export keyword to a\ndeclaration, or use the export {name}; syntax.\n\nDo not use default exports. Importing modules must give a name to these values,\nwhich can lead to inconsistencies in naming across modules.\n\n// Do not use default exports:\nexport default class Foo { ... } // BAD!\n\n\n// Use named exports:\nexport class Foo { ... }\n\n\n// Alternate style named exports:\nclass Foo { ... }\n\nexport {Foo};\n\n\n\n\n3.4.2.2 Mutability of exports\n\nExported variables must not be mutated outside of module initialization.\n\nThere are alternatives if mutation is needed, including exporting a constant\nreference to an object that has mutable fields or exporting accessor functions for\nmutable data.\n\n// Bad: both foo and mutateFoo are exported and mutated.\nexport let /** number */ foo = 0;\n\n/**\n * Mutates foo.\n */\nexport function mutateFoo() {\n  ++foo;\n}\n\n/**\n * @param {function(number): number} newMutateFoo\n */\nexport function setMutateFoo(newMutateFoo) {\n  // Exported classes and functions can be mutated!\n  mutateFoo = () => {\n    foo = newMutateFoo(foo);\n  };\n}\n\n\n// Good: Rather than export the mutable variables foo and mutateFoo directly,\n// instead make them module scoped and export a getter for foo and a wrapper for\n// mutateFooFunc.\nlet /** number */ foo = 0;\nlet /** function(number): number */ mutateFooFunc = (foo) => foo + 1;\n\n/** @return {number} */\nexport function getFoo() {\n  return foo;\n}\n\nexport function mutateFoo() {\n  foo = mutateFooFunc(foo);\n}\n\n/** @param {function(number): number} mutateFoo */\nexport function setMutateFoo(mutateFoo) {\n  mutateFooFunc = mutateFoo;\n}\n\n\n\n\n3.4.2.3 export from\n\nexport from statements must not be line wrapped and are therefore an\nexception to the 80-column limit. This applies to both export from flavors.\n\nexport {specificName} from './other.js';\nexport * from './another.js';\n\n\n3.4.3 Circular Dependencies in ES modules\n\nDo not create cycles between ES modules, even though the ECMAScript\nspecification allows this. Note that it is possible to create cycles with both\nthe import and export statements.\n\n// a.js\nimport './b.js';\n\n\n// b.js\nimport './a.js';\n\n// `export from` can cause circular dependencies too!\nexport {x} from './c.js';\n\n\n// c.js\nimport './b.js';\n\nexport let x;\n\n\n\n\n3.4.4 Interoperating with Closure\n\n\n\n3.4.4.1 Referencing goog\n\nTo reference the Closure goog namespace, import Closure's goog.js.\n\nimport * as goog from '../closure/goog/goog.js';\n\nconst {compute} = goog.require('a.name');\n\nexport const CONSTANT = compute();\n\n\ngoog.js exports only a subset of properties from the global goog that can be\nused in ES modules.\n\n\n\n3.4.4.2 goog.require in ES modules\n\ngoog.require in ES modules works as it does in goog.module files. You can\nrequire any Closure namespace symbol (i.e., symbols created by goog.provide or\ngoog.module) and goog.require will return the value.\n\nimport * as goog from '../closure/goog/goog.js';\nimport * as anEsModule from './anEsModule.js';\n\nconst GoogPromise = goog.require('goog.Promise');\nconst myNamespace = goog.require('my.namespace');\n\n\n\n\n3.4.4.3 Declaring Closure Module IDs in ES modules\n\ngoog.declareModuleId can be used within ES modules to declare a\ngoog.module-like module ID. This means that this module ID can be\ngoog.required, goog.module.getd etc. as if it were\na goog.module that did not call goog.module.declareLegacyNamespace. It does\nnot create the module ID as a globally available JavaScript symbol.\n\nA goog.require (or goog.module.get) for a module ID from\ngoog.declareModuleId will always return the module object (as if it was\nimport *'d). As a result, the argument to goog.declareModuleId should always\nend with a lowerCamelCaseName.\n\nNote: It is an error to call goog.module.declareLegacyNamespace in an ES\nmodule, it can only be called from goog.module files. There is no direct way\nto associate a legacy namespace with an ES module.\n\ngoog.declareModuleId should only be used to upgrade Closure files to ES\nmodules in place, where named exports are used.\n\nimport * as goog from '../closure/goog.js';\n\ngoog.declareModuleId('my.esm');\n\nexport class Class {};\n\n\n3.5 goog.setTestOnly\n\nIn a goog.module file the goog.module statement and, if present,\ngoog.module.declareLegacyNamespace() statement may optionally be followed by a\ncall to goog.setTestOnly().\n\nIn an ES module the import statements may optionally be\nfollowed by a call to goog.setTestOnly().\n\n3.6 goog.require and goog.requireType statements\n\nImports are done with goog.require and goog.requireType statements. The\nnames imported by a goog.require statement may be used both in code and in\ntype annotations, while those imported by a goog.requireType may be used in\ntype annotations only.\n\nThe goog.require and goog.requireType statements form a contiguous block\nwith no empty lines. This block follows the goog.module declaration separated\nby a single empty line. The entire argument to\ngoog.require or goog.requireType is a namespace defined by a goog.module\nin a separate file. goog.require and goog.requireType statements may not\nappear anywhere else in the file.\n\nEach goog.require or goog.requireType is assigned to a single constant\nalias, or else destructured into several constant aliases. These aliases are the\nonly acceptable way to refer to dependencies in type annotations or code. Fully\nqualified namespaces must not be used anywhere, except as an argument to\ngoog.require or goog.requireType.\n\nException: Types, variables, and functions declared in externs files have to\nuse their fully qualified name in type annotations and code.\n\nWhen goog.require is assigned to a single constant alias, it must match the\nfinal dot-separated component of the imported module's namespace.\n\nException: In certain cases, additional components of the namespace can be\nused to form a longer alias. The resulting alias must retain the original\nidentifier's casing such that it still correctly identifies its type. Longer\naliases may be used to disambiguate otherwise identical aliases, or if it\nsignificantly improves readability. In addition, a longer alias must be used to\nprevent masking native types such as Element, Event, Error, Map, and\nPromise (for a more complete list, see Standard Built-in Objects and\nWeb APIs at MDN).\nWhen renaming destructured aliases, a space must follow the colon\nas required in ??.\n\nA file should not contain both a goog.require and a goog.requireType\nstatement for the same namespace. If the imported name is used both in code and\nin type annotations, it should be imported by a single goog.require statement.\n\nIf a module is imported only for its side effects, the call must be a\ngoog.require (not a goog.requireType) and assignment may be omitted. A\ncomment is required to explain why this is needed and suppress a compiler\nwarning.\n\n\n\nThe lines are sorted according to the following rules: All requires with a name\non the left hand side come first, sorted alphabetically by those names. Then\ndestructuring requires, again sorted by the names on the left hand side.\nFinally, any require calls that are standalone (generally these are for modules\nimported just for their side effects).\n\nTip: There’s no need to memorize this order and enforce it manually. You can\nrely on your IDE to report requires\nthat are not sorted correctly.\n\nIf a long alias or module name would cause a line to exceed the 80-column limit,\nit must not be wrapped: require lines are an exception to the 80-column\nlimit.\n\nExample:\n\n// Standard alias style.\nconst asserts = goog.require('goog.asserts');\n// Namespace-based alias used to disambiguate.\nconst testingAsserts = goog.require('goog.testing.asserts');\n// Standard destructuring into aliases.\nconst {MyClass} = goog.require('some.package');\nconst {MyType} = goog.requireType('other.package');\nconst {clear, clone} = goog.require('goog.array');\nconst {Rgb} = goog.require('goog.color');\n// Namespace-based destructuring into aliases used to disambiguate.\nconst {MyClass: NsMyClass} = goog.require('other.ns');\nconst {SomeType: FooSomeType} = goog.requireType('foo.types');\nconst {clear: objectClear, clone: objectClone} = goog.require('goog.object');\n// Namespace-based destructuring into aliases used to prevent masking native type.\nconst {Element: RendererElement} = goog.require('web.renderer');\n// Out of sequence namespace-based aliases used to improve readability.\n// Also, require lines longer than 80 columns must not be wrapped.\nconst {SomeDataStructure: SomeDataStructureModel} = goog.requireType('identical.package.identifiers.models');\nconst {SomeDataStructure: SomeDataStructureProto} = goog.require('proto.identical.package.identifiers');\n// goog.require without an alias in order to trigger side effects.\n/** @suppress {extraRequire} Initializes MyFramework. */\ngoog.require('my.framework.initialization');\n\n\nDiscouraged:\n\n// Some legacy code uses a \"default export\" style to export a single class, enum,\n// record type, etc. Do not use this pattern in new JS.\n// When using a \"default export\", prefer destructuring into aliases.\nconst MyClass = goog.require('some.package.MyClass');\nconst MyType = goog.requireType('some.package.MyType');\n\n\n// If necessary to disambiguate, prefer PackageClass over SomeClass as it is\n// closer to the format of the module name.\nconst SomeClass = goog.require('some.package.Class');\n\n\nDisallowed:\n\n// Extra terms must come from the namespace.\nconst MyClassForBizzing = goog.require('some.package.MyClass');\n// Alias must include the entire final namespace component.\nconst MyClass = goog.require('some.package.MyClassForBizzing');\n// Alias must not mask native type (should be `const JspbMap` here).\nconst Map = goog.require('jspb.Map');\n// Don't break goog.require lines over 80 columns.\nconst SomeDataStructure =\n    goog.require('proto.identical.package.identifiers.SomeDataStructure');\n// Alias must be based on the namespace.\nconst randomName = goog.require('something.else');\n// Missing a space after the colon.\nconst {Foo:FooProto} = goog.require('some.package.proto.Foo');\n// goog.requireType without an alias.\ngoog.requireType('some.package.with.a.Type');\n\n\n/**\n * @param {!some.unimported.Dependency} param All external types used in JSDoc\n *     annotations must be goog.require'd, unless declared in externs.\n */\nfunction someFunction(param) {\n  // goog.require lines must be at the top level before any other code.\n  const alias = goog.require('my.long.name.alias');\n  // ...\n}\n\n\n3.7 The file’s implementation\n\nThe actual implementation follows after all dependency information is declared\n(separated by at least one blank line).\n\nThis may consist of any module-local declarations (constants, variables,\nclasses, functions, etc), as well as any exported symbols.\n\n4 Formatting\n\nTerminology Note: block-like construct refers to the body of a class,\nfunction, method, or brace-delimited block of code. Note that, by\n?? and ??, any array or\nobject literal may optionally be treated as if it were a block-like construct.\n\nTip: Use clang-format. The JavaScript community has invested effort to make\nsure clang-format does the right thing on JavaScript files. clang-format has\nintegration with several popular editors.\n\n4.1 Braces\n\n4.1.1 Braces are used for all control structures\n\nBraces are required for all control structures (i.e. if, else, for, do,\nwhile, as well as any others), even if the body contains only a single\nstatement. The first statement of a non-empty block must begin on its own line.\n\nDisallowed:\n\nif (someVeryLongCondition())\n  doSomething();\n\nfor (let i = 0; i < foo.length; i++) bar(foo[i]);\n\n\nException: A simple if statement that can fit entirely on a single line with\nno wrapping (and that doesn’t have an else) may be kept on a single line with no\nbraces when it improves readability. This is the only case in which a control\nstructure may omit braces and newlines.\n\nif (shortCondition()) foo();\n\n\n4.1.2 Nonempty blocks: K&R style\n\nBraces follow the Kernighan and Ritchie style (Egyptian brackets) for\nnonempty blocks and block-like constructs:\n\n\nNo line break before the opening brace.\nLine break after the opening brace.\nLine break before the closing brace.\nLine break after the closing brace if that brace terminates a statement or\nthe body of a function or class statement, or a class method. Specifically,\nthere is no line break after the brace if it is followed by else,\ncatch, while, or a comma, semicolon, or right-parenthesis.\n\n\nExample:\n\nclass InnerClass {\n  constructor() {}\n\n  /** @param {number} foo */\n  method(foo) {\n    if (condition(foo)) {\n      try {\n        // Note: this might fail.\n        something();\n      } catch (err) {\n        recover();\n      }\n    }\n  }\n}\n\n\n4.1.3 Empty blocks: may be concise\n\nAn empty block or block-like construct may be closed immediately after it is\nopened, with no characters, space, or line break in between (i.e. {}),\nunless it is a part of a multi-block statement (one that directly contains\nmultiple blocks: if/else or try/catch/finally).\n\nExample:\n\nfunction doNothing() {}\n\n\nDisallowed:\n\nif (condition) {\n  // …\n} else if (otherCondition) {} else {\n  // …\n}\n\ntry {\n  // …\n} catch (e) {}\n\n\n4.2 Block indentation: +2 spaces\n\nEach time a new block or block-like construct is opened, the indent increases by\ntwo spaces. When the block ends, the indent returns to the previous indent\nlevel. The indent level applies to both code and comments throughout the block.\n(See the example in ??).\n\n4.2.1 Array literals: optionally block-like\n\nAny array literal may optionally be formatted as if it were a “block-like\nconstruct.” For example, the following are all valid (not an exhaustive\nlist):\n\nconst a = [\n  0,\n  1,\n  2,\n];\n\nconst b =\n    [0, 1, 2];\n\n\n\nconst c = [0, 1, 2];\n\nsomeMethod(foo, [\n  0, 1, 2,\n], bar);\n\n\nOther combinations are allowed, particularly when emphasizing semantic groupings\nbetween elements, but should not be used only to reduce the vertical size of\nlarger arrays.\n\n4.2.2 Object literals: optionally block-like\n\nAny object literal may optionally be formatted as if it were a “block-like\nconstruct.” The same examples apply as ??. For\nexample, the following are all valid (not an exhaustive list):\n\nconst a = {\n  a: 0,\n  b: 1,\n};\n\nconst b =\n    {a: 0, b: 1};\n\n\nconst c = {a: 0, b: 1};\n\nsomeMethod(foo, {\n  a: 0, b: 1,\n}, bar);\n\n\n4.2.3 Class literals\n\nClass literals (whether declarations or expressions) are indented as blocks. Do\nnot add semicolons after methods, or after the closing brace of a class\ndeclaration (statements—such as assignments—that contain class expressions\nare still terminated with a semicolon). For inheritance, the extends keyword\nis sufficient unless the superclass is templatized. Subclasses of templatized\ntypes must explicitly specify the template type in an @extends JSDoc\nannotation, even if it is just passing along the same template name.\n\nExample:\n\n/** @template T */\nclass Foo {\n  /** @param {T} x */\n  constructor(x) {\n    /** @type {T} */\n    this.x = x;\n  }\n}\n\n/** @extends {Foo<number>} */\nclass Bar extends Foo {\n  constructor() {\n    super(42);\n  }\n}\n\nexports.Baz = class extends Bar {\n  /** @return {number} */\n  method() {\n    return this.x;\n  }\n};\n\n\n/** @extends {Bar} */ // <-- unnecessary @extends\nexports.Baz = class extends Bar {\n  /** @return {number} */\n  method() {\n    return this.x;\n  }\n};\n\n\n4.2.4 Function expressions\n\nWhen declaring an anonymous function in the list of arguments for a function\ncall, the body of the function is indented two spaces more than the preceding\nindentation depth.\n\nExample:\n\nprefix.something.reallyLongFunctionName('whatever', (a1, a2) => {\n  // Indent the function body +2 relative to indentation depth\n  // of the 'prefix' statement one line above.\n  if (a1.equals(a2)) {\n    someOtherLongFunctionName(a1);\n  } else {\n    andNowForSomethingCompletelyDifferent(a2.parrot);\n  }\n});\n\nsome.reallyLongFunctionCall(arg1, arg2, arg3)\n    .thatsWrapped()\n    .then((result) => {\n      // Indent the function body +2 relative to the indentation depth\n      // of the '.then()' call.\n      if (result) {\n        result.use();\n      }\n    });\n\n\n4.2.5 Switch statements\n\nAs with any other block, the contents of a switch block are indented +2.\n\n\n\nAfter a switch label, a newline appears, and the indentation level is increased\n+2, exactly as if a block were being opened. An explicit block may be used if\nrequired by lexical scoping. The following switch label returns to the previous\nindentation level, as if a block had been closed.\n\nA blank line is optional between a break and the following case.\n\nExample:\n\nswitch (animal) {\n  case Animal.BANDERSNATCH:\n    handleBandersnatch();\n    break;\n\n  case Animal.JABBERWOCK:\n    handleJabberwock();\n    break;\n\n  default:\n    throw new Error('Unknown animal');\n}\n\n\n4.3 Statements\n\n4.3.1 One statement per line\n\nEach statement is followed by a line-break.\n\n4.3.2 Semicolons are required\n\nEvery statement must be terminated with a semicolon. Relying on automatic\nsemicolon insertion is forbidden.\n\n4.4 Column limit: 80\n\nJavaScript code has a column limit of 80 characters. Except as noted below, any\nline that would exceed this limit must be line-wrapped, as explained in\n??.\n\nExceptions:\n\n\ngoog.module, goog.require and goog.requireType statements (see\n?? and ??).\nES module import and export from statements (see\n?? and ??).\nLines where obeying the column limit is not possible or would hinder\ndiscoverability. Examples include:\n\nA long URL which should be clickable in source.\nA shell command intended to be copied-and-pasted.\nA long string literal which may need to be copied or searched for wholly\n(e.g., a long file path).\n\n\n\n4.5 Line-wrapping\n\nTerminology Note: Line wrapping is breaking a chunk of code into multiple\nlines to obey column limit, where the chunk could otherwise legally fit in a\nsingle line.\n\nThere is no comprehensive, deterministic formula showing exactly how to\nline-wrap in every situation. Very often there are several valid ways to\nline-wrap the same piece of code.\n\nNote: While the typical reason for line-wrapping is to avoid overflowing the\ncolumn limit, even code that would in fact fit within the column limit may be\nline-wrapped at the author's discretion.\n\nTip: Extracting a method or local variable may solve the problem without the\nneed to line-wrap.\n\n4.5.1 Where to break\n\nThe prime directive of line-wrapping is: prefer to break at a higher syntactic\nlevel. \n\nPreferred:\n\ncurrentEstimate =\n    calc(currentEstimate + x * currentEstimate) /\n        2.0;\n\n\nDiscouraged:\n\ncurrentEstimate = calc(currentEstimate + x *\n    currentEstimate) / 2.0;\n\n\nIn the preceding example, the syntactic levels from highest to lowest are as\nfollows: assignment, division, function call, parameters, number constant.\n\nOperators are wrapped as follows:\n\n\nWhen a line is broken at an operator the break comes after the symbol. (Note\nthat this is not the same practice used in Google style for Java.)\n\nThis does not apply to the dot (.), which is not actually an\noperator.\n\nA method or constructor name stays attached to the open parenthesis (()\nthat follows it.\nA comma (,) stays attached to the token that precedes it.\nA line break is never added between a return and the return value as this\nwould change the meaning of the code.\nJSDoc annotations with type names break after {. This is necessary as\nannotations with optional types (@const, @private, @param, etc) do not scan\nthe next line.\n\n\n\nNote: The primary goal for line wrapping is to have clear code, not\nnecessarily code that fits in the smallest number of lines.\n\n\n4.5.2 Indent continuation lines at least +4 spaces\n\nWhen line-wrapping, each line after the first (each continuation line) is\nindented at least +4 from the original line, unless it falls under the rules of\nblock indentation.\n\nWhen there are multiple continuation lines, indentation may be varied beyond +4\nas appropriate. In general, continuation lines at a deeper syntactic level are\nindented by larger multiples of 4, and two lines use the same indentation level\nif and only if they begin with syntactically parallel elements.\n\n?? addresses the discouraged practice of\nusing a variable number of spaces to align certain tokens with previous lines.\n\n4.6 Whitespace\n\n4.6.1 Vertical whitespace\n\nA single blank line appears:\n\n\nBetween consecutive methods in a class or object literal\n\nException: A blank line between two consecutive properties definitions\nin an object literal (with no other code between them) is optional. Such\nblank lines are used as needed to create logical groupings of fields.\n\nWithin method bodies, sparingly to create logical groupings of statements.\nBlank lines at the start or end of a function body are not allowed.\nOptionally before the first or after the last method in a class or object\nliteral (neither encouraged nor discouraged).\nAs required by other sections of this document (e.g.\n??).\n\n\nMultiple consecutive blank lines are permitted, but never required (nor\nencouraged).\n\n4.6.2 Horizontal whitespace\n\nUse of horizontal whitespace depends on location, and falls into three broad\ncategories: leading (at the start of a line), trailing (at the end of a\nline), and internal. Leading whitespace (i.e., indentation) is addressed\nelsewhere. Trailing whitespace is forbidden.\n\nBeyond where required by the language or other style rules, and apart from\nliterals, comments, and JSDoc, a single internal ASCII space also appears in the\nfollowing places only.\n\n\nSeparating any reserved word (such as if, for, or catch) except for\nfunction and super, from an open parenthesis (() that follows it on\nthat line.\nSeparating any reserved word (such as else or catch) from a closing\ncurly brace (}) that precedes it on that line.\nBefore any open curly brace ({), with two exceptions:\n\nBefore an object literal that is the first argument of a function or the\nfirst element in an array literal (e.g. foo({a: [{c: d}]})).\nIn a template expansion, as it is forbidden by the language (e.g. valid:\n`ab${1 + 2}cd`, invalid: `xy$ {3}z`).\n\nOn both sides of any binary or ternary operator.\nAfter a comma (,) or semicolon (;). Note that spaces are never allowed\nbefore these characters.\nAfter the colon (:) in an object literal.\nOn both sides of the double slash (//) that begins an end-of-line comment.\nHere, multiple spaces are allowed, but not required.\nAfter an open-block comment character and on both sides of close characters\n(e.g. for short-form type declarations, casts, and parameter name comments:\nthis.foo = /** @type {number} */ (bar); or function(/** string */ foo)\n{; or baz(/* buzz= */ true)).\n\n\n4.6.3 Horizontal alignment: discouraged\n\nTerminology Note: Horizontal alignment is the practice of adding a\nvariable number of additional spaces in your code with the goal of making\ncertain tokens appear directly below certain other tokens on previous lines.\n\nThis practice is permitted, but it is generally discouraged by Google Style.\nIt is not even required to maintain horizontal alignment in places where it\nwas already used.\n\nHere is an example without alignment, followed by one with alignment. Both are\nallowed, but the latter is discouraged:\n\n{\n  tiny: 42, // this is great\n  longer: 435, // this too\n};\n\n{\n  tiny:   42,  // permitted, but future edits\n  longer: 435, // may leave it unaligned\n};\n\n\nTip: Alignment can aid readability, but it creates problems for future\nmaintenance. Consider a future change that needs to touch just one line. This\nchange may leave the formerly-pleasing formatting mangled, and that is allowed.\nMore often it prompts the coder (perhaps you) to adjust whitespace on nearby\nlines as well, possibly triggering a cascading series of reformattings. That\none-line change now has a blast radius. This can at worst result in pointless\nbusywork, but at best it still corrupts version history information, slows down\nreviewers and exacerbates merge conflicts.\n\n4.6.4 Function arguments\n\nPrefer to put all function arguments on the same line as the function name. If\ndoing so would exceed the 80-column limit, the arguments must be line-wrapped in\na readable way. To save space, you may wrap as close to 80 as possible, or put\neach argument on its own line to enhance readability. Indentation should be four\nspaces. Aligning to the parenthesis is allowed, but discouraged. Below are the\nmost common patterns for argument wrapping:\n\n// Arguments start on a new line, indented four spaces. Preferred when the\n// arguments don't fit on the same line with the function name (or the keyword\n// \"function\") but fit entirely on the second line. Works with very long\n// function names, survives renaming without reindenting, low on space.\ndoSomething(\n    descriptiveArgumentOne, descriptiveArgumentTwo, descriptiveArgumentThree) {\n  // …\n}\n\n// If the argument list is longer, wrap at 80. Uses less vertical space,\n// but violates the rectangle rule and is thus not recommended.\ndoSomething(veryDescriptiveArgumentNumberOne, veryDescriptiveArgumentTwo,\n    tableModelEventHandlerProxy, artichokeDescriptorAdapterIterator) {\n  // …\n}\n\n// Four-space, one argument per line.  Works with long function names,\n// survives renaming, and emphasizes each argument.\ndoSomething(\n    veryDescriptiveArgumentNumberOne,\n    veryDescriptiveArgumentTwo,\n    tableModelEventHandlerProxy,\n    artichokeDescriptorAdapterIterator) {\n  // …\n}\n\n\n4.7 Grouping parentheses: recommended\n\nOptional grouping parentheses are omitted only when the author and reviewer\nagree that there is no reasonable chance that the code will be misinterpreted\nwithout them, nor would they have made the code easier to read. It is not\nreasonable to assume that every reader has the entire operator precedence table\nmemorized.\n\nDo not use unnecessary parentheses around the entire expression following\ndelete, typeof, void, return, throw, case, in, of, or yield.\n\nParentheses are required for type casts: /** @type {!Foo} */ (foo).\n\n\n\nThis section addresses implementation comments. JSDoc is addressed separately\nin ??.\n\n\n\nBlock comments are indented at the same level as the surrounding code. They may\nbe in /* … */ or //-style. For multi-line /* … */ comments, subsequent\nlines must start with * aligned with the * on the previous line, to make\ncomments obvious with no extra context.\n\n/*\n * This is\n * okay.\n */\n\n// And so\n// is this.\n\n/* This is fine, too. */\n\n\nComments are not enclosed in boxes drawn with asterisks or other characters.\n\nDo not use JSDoc (/** … */) for implementation comments.\n\n\n\n“Parameter name” comments should be used whenever the value and method name do\nnot sufficiently convey the meaning, and refactoring the method to be clearer is\ninfeasible .\nTheir preferred format is before the value with =:\n\nsomeFunction(obviousParam, /* shouldRender= */ true, /* name= */ 'hello');\n\n\nFor consistency with surrounding code you may put them after the value without\n=:\n\nsomeFunction(obviousParam, true /* shouldRender */, 'hello' /* name */);\n\n\n5 Language features\n\nJavaScript includes many dubious (and even dangerous) features. This section\ndelineates which features may or may not be used, and any additional constraints\non their use.\n\nLanguage features which are not discussed in this style guide may be used with\nno recommendations of their usage.\n\n5.1 Local variable declarations\n\n5.1.1 Use const and let\n\nDeclare all local variables with either const or let. Use const by\ndefault, unless a variable needs to be reassigned. The var keyword\nmust not be used.\n\n5.1.2 One variable per declaration\n\nEvery local variable declaration declares only one variable: declarations such\nas let a = 1, b = 2; are not used.\n\n5.1.3 Declared when needed, initialized as soon as possible\n\nLocal variables are not habitually declared at the start of their containing\nblock or block-like construct. Instead, local variables are declared close to\nthe point they are first used (within reason), to minimize their scope, and\ninitialized as soon as possible.\n\n5.1.4 Declare types as needed\n\nJSDoc type annotations may be added either on the line above the declaration, or\nelse inline before the variable name if no other JSDoc is present.\n\nExample:\n\nconst /** !Array<number> */ data = [];\n\n/**\n * Some description.\n * @type {!Array<number>}\n */\nconst data = [];\n\n\nMixing inline and JSDoc styles is not allowed: the compiler will only process\nthe first JsDoc and the inline annotations will be lost.\n\n/** Some description. */\nconst /** !Array<number> */ data = [];\n\n\nTip: There are many cases where the compiler can infer a templatized type but\nnot its parameters. This is particularly the case when the initializing literal\nor constructor call does not include any values of the template parameter type\n(e.g., empty arrays, objects, Maps, or Sets), or if the variable is modified\nin a closure. Local variable type annotations are particularly helpful in these\ncases since otherwise the compiler will infer the template parameter as unknown.\n\n5.2 Array literals\n\n5.2.1 Use trailing commas\n\n\n\nInclude a trailing comma whenever there is a line break between the final\nelement and the closing bracket.\n\nExample:\n\nconst values = [\n  'first value',\n  'second value',\n];\n\n\n5.2.2 Do not use the variadic Array constructor\n\nThe constructor is error-prone if arguments are added or removed. Use a literal\ninstead.\n\nDisallowed:\n\nconst a1 = new Array(x1, x2, x3);\nconst a2 = new Array(x1, x2);\nconst a3 = new Array(x1);\nconst a4 = new Array();\n\n\nThis works as expected except for the third case: if x1 is a whole number then\na3 is an array of size x1 where all elements are undefined. If x1 is any\nother number, then an exception will be thrown, and if it is anything else then\nit will be a single-element array.\n\nInstead, write\n\nconst a1 = [x1, x2, x3];\nconst a2 = [x1, x2];\nconst a3 = [x1];\nconst a4 = [];\n\n\nExplicitly allocating an array of a given length using new Array(length) is\nallowed when appropriate.\n\n5.2.3 Non-numeric properties\n\nDo not define or use non-numeric properties on an array (other than length).\nUse a Map (or Object) instead.\n\n5.2.4 Destructuring\n\nArray literals may be used on the left-hand side of an assignment to perform\ndestructuring (such as when unpacking multiple values from a single array or\niterable). A final rest element may be included (with no space between the\n... and the variable name). Elements should be omitted if they are unused.\n\nconst [a, b, c, ...rest] = generateResults();\nlet [, b,, d] = someArray;\n\n\nDestructuring may also be used for function parameters (note that a parameter\nname is required but ignored). Always specify [] as the default value if a\ndestructured array parameter is optional, and provide default values on the left\nhand side:\n\n/** @param {!Array<number>=} param1 */\nfunction optionalDestructuring([a = 4, b = 2] = []) { … };\n\n\nDisallowed:\n\nfunction badDestructuring([a, b] = [4, 2]) { … };\n\n\nTip: For (un)packing multiple values into a function’s parameter or return,\nprefer object destructuring to array destructuring when possible, as it allows\nnaming the individual elements and specifying a different type for each.\n\n5.2.5 Spread operator\n\nArray literals may include the spread operator (...) to flatten elements out\nof one or more other iterables. The spread operator should be used instead of\nmore awkward constructs with Array.prototype. There is no space after the\n....\n\nExample:\n\n[...foo]   // preferred over Array.prototype.slice.call(foo)\n[...foo, ...bar]   // preferred over foo.concat(bar)\n\n\n5.3 Object literals\n\n5.3.1 Use trailing commas\n\nInclude a trailing comma whenever there is a line break between the final\nproperty and the closing brace.\n\n5.3.2 Do not use the Object constructor\n\nWhile Object does not have the same problems as Array, it is still\ndisallowed for consistency. Use an object literal ({} or {a: 0, b: 1, c: 2})\ninstead.\n\n5.3.3 Do not mix quoted and unquoted keys\n\nObject literals may represent either structs (with unquoted keys and/or\nsymbols) or dicts (with quoted and/or computed keys). Do not mix these key\ntypes in a single object literal.\n\nDisallowed:\n\n{\n  width: 42, // struct-style unquoted key\n  'maxWidth': 43, // dict-style quoted key\n}\n\n\nThis also extends to passing the property name to functions, like\nhasOwnProperty. In particular, doing so will break in compiled code because\nthe compiler cannot rename/obfuscate the string literal.\n\nDisallowed:\n\n/** @type {{width: number, maxWidth: (number|undefined)}} */\nconst o = {width: 42};\nif (o.hasOwnProperty('maxWidth')) {\n  ...\n}\n\n\nThis is best implemented as:\n\n/** @type {{width: number, maxWidth: (number|undefined)}} */\nconst o = {width: 42};\nif (o.maxWidth != null) {\n  ...\n}\n\n\n5.3.4 Computed property names\n\nComputed property names (e.g., {['key' + foo()]: 42}) are allowed, and are\nconsidered dict-style (quoted) keys (i.e., must not be mixed with non-quoted\nkeys) unless the computed property is a\nsymbol\n(e.g., [Symbol.iterator]). Enum values may also be used for computed keys, but\nshould not be mixed with non-enum keys in the same literal.\n\n5.3.5 Method shorthand\n\nMethods can be defined on object literals using the method shorthand ({method()\n{… }}) in place of a colon immediately followed by a function or arrow\nfunction literal.\n\nExample:\n\nreturn {\n  stuff: 'candy',\n  method() {\n    return this.stuff;  // Returns 'candy'\n  },\n};\n\n\nNote that this in a method shorthand or function refers to the object\nliteral itself whereas this in an arrow function refers to the scope outside\nthe object literal.\n\nExample:\n\nclass {\n  getObjectLiteral() {\n    this.stuff = 'fruit';\n    return {\n      stuff: 'candy',\n      method: () => this.stuff,  // Returns 'fruit'\n    };\n  }\n}\n\n\n5.3.6 Shorthand properties\n\nShorthand properties are allowed on object literals.\n\nExample:\n\nconst foo = 1;\nconst bar = 2;\nconst obj = {\n  foo,\n  bar,\n  method() { return this.foo + this.bar; },\n};\nassertEquals(3, obj.method());\n\n\n5.3.7 Destructuring\n\nObject destructuring patterns may be used on the left-hand side of an assignment\nto perform destructuring and unpack multiple values from a single object.\n\nDestructured objects may also be used as function parameters, but should be kept\nas simple as possible: a single level of unquoted shorthand properties. Deeper\nlevels of nesting and computed properties may not be used in parameter\ndestructuring. Specify any default values in the left-hand-side of the\ndestructured parameter ({str = 'some default'} = {}, rather than\n{str} = {str: 'some default'}), and if a\ndestructured object is itself optional, it must default to {}. The JSDoc for\nthe destructured parameter may be given any name (the name is unused but is\nrequired by the compiler).\n\nExample:\n\n/**\n * @param {string} ordinary\n * @param {{num: (number|undefined), str: (string|undefined)}=} param1\n *     num: The number of times to do something.\n *     str: A string to do stuff to.\n */\nfunction destructured(ordinary, {num, str = 'some default'} = {}) {}\n\n\nDisallowed:\n\n/** @param {{x: {num: (number|undefined), str: (string|undefined)}}} param1 */\nfunction nestedTooDeeply({x: {num, str}}) {};\n/** @param {{num: (number|undefined), str: (string|undefined)}=} param1 */\nfunction nonShorthandProperty({num: a, str: b} = {}) {};\n/** @param {{a: number, b: number}} param1 */\nfunction computedKey({a, b, [a + b]: c}) {};\n/** @param {{a: number, b: string}=} param1 */\nfunction nontrivialDefault({a, b} = {a: 2, b: 4}) {};\n\n\nDestructuring may also be used for goog.require statements, and in this case\nmust not be wrapped: the entire statement occupies one line, regardless of how\nlong it is (see ??).\n\n5.3.8 Enums\n\nEnumerations are defined by adding the @enum annotation to an object literal.\nEnums must be module-local or assigned directly on exports, not nested under a\ntype or object.\n\nAdditional properties may not be added to an enum after it is defined. Enums\nmust be constant. All enum values must be either a string literal or a number.\n\n/**\n * Supported temperature scales.\n * @enum {string}\n */\nconst TemperatureScale = {\n  CELSIUS: 'celsius',\n  FAHRENHEIT: 'fahrenheit',\n};\n\n/**\n * An enum with two values.\n * @enum {number}\n */\nconst Value = {\n  /** The value used shall have been the first. */\n  FIRST_VALUE: 1,\n  /** The second among two values. */\n  SECOND_VALUE: 2,\n};\n\n\nFor string enums, all values must be statically initialized and not computed\nusing arithmetic operators, template literal substitution, function calls or\neven a variable reference.\n\nconst ABSOLUTE_ZERO = '-273°F';\n\n/**\n * Not supported computed values in string enum.\n * @enum {string}\n */\nconst TemperatureInFahrenheit = {\n  MIN_POSSIBLE: ABSOLUTE_ZERO,\n  ZERO_FAHRENHEIT: 0 + '°F',\n  ONE_FAHRENHEIT: `${Values.FIRST_VALUE}°F`,\n  TWO_FAHRENHEIT: Values.SECOND_VALUE + '°F',\n  SOME_FAHRENHEIT: getTemperatureInFahrenheit() + '°F',\n};\n\n\nNote: Although TypeScript supports a few more patterns for enum values (e.g A:\n'a'+'b', etc), the restriction of only allowing string literals and numbers for\nenum values is to aid migration to TypeScript. For complex values consider using\na const object without @enum. \n\n5.4 Classes\n\n5.4.1 Constructors\n\nConstructors are optional. Subclass constructors must call super() before\nsetting any fields or otherwise accessing this. Interfaces should declare\nnon-method properties in the constructor.\n\n5.4.2 Fields\n\nDefine all of a concrete object’s fields (i.e. all properties other than\nmethods) in the constructor. Annotate fields that are never reassigned with\n@const (these need not be deeply immutable). Annotate non-public fields with\nthe proper visibility annotation (@private, @protected, @package).\n@private fields' names may optionally end with an underscore. Fields must not\nbe defined within a nested scope in the constructor nor on a concrete class's\nprototype.\n\nExample:\n\nclass Foo {\n  constructor() {\n    /** @private @const {!Bar} */\n    this.bar_ = computeBar();\n\n    /** @protected @const {!Baz} */\n    this.baz = computeBaz();\n  }\n}\n\n\nTip: Properties should never be added to or removed from an instance after the\nconstructor is finished, since it significantly hinders VMs’ ability to\noptimize. If necessary, fields that are initialized later should be explicitly\nset to undefined in the constructor to prevent later shape changes. Adding\n@struct to an object will check that undeclared properties are not\nadded/accessed. Classes have this added by default.\n\n5.4.3 Computed properties\n\n\n\nComputed properties may only be used in classes when the property is a symbol.\nDict-style properties (that is, quoted or computed non-symbol keys, as defined\nin ??) are not allowed. A [Symbol.iterator]\nmethod should be defined for any classes that are logically iterable. Beyond\nthis, Symbol should be used sparingly.\n\nTip: be careful of using any other built-in symbols (e.g.,\nSymbol.isConcatSpreadable) as they are not polyfilled by the compiler and will\ntherefore not work in older browsers.\n\n5.4.4 Static methods\n\n\n\nWhere it does not interfere with readability, prefer module-local functions over\nprivate static methods.\n\nCode should not rely on dynamic dispatch of static methods, because it\ninterferes with Closure Compiler optimizations. Static methods should only be\ncalled on the base class itself. Static methods should not be called on\nvariables containing a dynamic instance that may be either the constructor or a\nsubclass constructor (and must be defined with @nocollapse if this is done),\nand must not be called directly on a subclass that doesn’t define the method\nitself. Do not access this in static methods.\n\nDisallowed:\n\n// Context for the examples below; by itself this code is allowed.\nclass Base {\n  /** @nocollapse */ static foo() {}\n}\nclass Sub extends Base {}\n\n// discouraged: don't call static methods dynamically\nfunction callFoo(cls) { cls.foo(); }\n\n// Disallowed: don't call static methods on subclasses that don't define it themselves\nSub.foo();\n\n// Disallowed: don't access this in static methods.\nclass Clazz {\n  static foo() {\n    return this.staticField;\n  }\n}\nClass.staticField = 1;\n\n\n5.4.5 Old-style class declarations\n\nWhile ES6 classes are preferred, there are cases where ES6 classes may not be\nfeasible. For example:\n\n\nIf there exist or will exist subclasses, including frameworks that create\nsubclasses, that cannot be immediately changed to use ES6 class syntax. If\nsuch a class were to use ES6 syntax, all downstream subclasses not using ES6\nclass syntax would need to be modified.\nFrameworks that require a known this value before calling the superclass\nconstructor, since constructors with ES6 super classes do not have access to\nthe instance this value until the call to super returns.\n\n\nIn all other ways the style guide still applies to this code: let, const,\ndefault parameters, rest, and arrow functions should all be used when\nappropriate.\n\ngoog.defineClass allows for a class-like definition similar to ES6 class\nsyntax:\n\nlet C = goog.defineClass(S, {\n  /**\n   * @param {string} value\n   */\n  constructor(value) {\n    S.call(this, 2);\n    /** @const */\n    this.prop = value;\n  },\n\n  /**\n   * @param {string} param\n   * @return {number}\n   */\n  method(param) {\n    return 0;\n  },\n});\n\n\nAlternatively, while goog.defineClass should be preferred for all new code,\nmore traditional syntax is also allowed.\n\n/**\n  * @constructor @extends {S}\n  * @param {string} value\n  */\nfunction C(value) {\n  S.call(this, 2);\n  /** @const */\n  this.prop = value;\n}\ngoog.inherits(C, S);\n\n/**\n * @param {string} param\n * @return {number}\n */\nC.prototype.method = function(param) {\n  return 0;\n};\n\n\nPer-instance properties should be defined in the constructor after the call to\nthe super class constructor, if there is a super class. Methods should be\ndefined on the prototype of the constructor.\n\nDefining constructor prototype hierarchies correctly is harder than it first\nappears! For that reason, it is best to use goog.inherits from\nthe Closure Library .\n\n5.4.6 Do not manipulate prototypes directly\n\nThe class keyword allows clearer and more readable class definitions than\ndefining prototype properties. Ordinary implementation code has no business\nmanipulating these objects, though they are still useful for defining classes as\ndefined in ??. Mixins and modifying the\nprototypes of builtin objects are explicitly forbidden.\n\nException: Framework code (such as Polymer, or Angular) may need to use prototypes, and should not resort\nto even-worse workarounds to avoid doing so.\n\n5.4.7 Getters and Setters\n\nDo not use JavaScript getter and setter properties. They are potentially\nsurprising and difficult to reason about, and have limited support in the\ncompiler. Provide ordinary methods instead.\n\nException: there are situations where defining a getter or setter is\nunavoidable (e.g. data binding frameworks such as Angular and Polymer, or for\ncompatibility with external APIs that cannot be adjusted). In these cases only,\ngetters and setters may be used with caution, provided they are defined with\nthe get and set shorthand method keywords or Object.defineProperties (not\nObject.defineProperty, which interferes with property renaming). Getters\nmust not change observable state.\n\nDisallowed:\n\nclass Foo {\n  get next() { return this.nextId++; }\n}\n\n\n5.4.8 Overriding toString\n\nThe toString method may be overridden, but must always succeed and never have\nvisible side effects.\n\nTip: Beware, in particular, of calling other methods from toString, since\nexceptional conditions could lead to infinite loops.\n\n5.4.9 Interfaces\n\nInterfaces may be declared with @interface or @record. Interfaces declared\nwith @record can be explicitly (i.e. via @implements) or implicitly\nimplemented by a class or object literal.\n\nAll methods on an interface must be non-static and method bodies must be empty\nblocks. Fields must be declared as uninitialized members in the class\nconstructor.\n\nExample:\n\n/**\n * Something that can frobnicate.\n * @record\n */\nclass Frobnicator {\n  constructor() {\n    /** @type {number} The number of attempts before giving up. */\n    this.attempts;\n  }\n\n  /**\n   * Performs the frobnication according to the given strategy.\n   * @param {!FrobnicationStrategy} strategy\n   */\n  frobnicate(strategy) {}\n}\n\n\n\n5.4.10 Abstract Classes\n\nUse abstract classes when appropriate. Abstract classes and methods must be\nannotated with @abstract. Do not use goog.abstractMethod. See\nabstract classes and methods.\n\n5.4.11 Do not create static container classes\n\nDo not use container classes with only static methods or properties for the sake\nof namespacing.\n\n// container.js\n// Bad: Container is an exported class that has only static methods and fields.\nclass Container {\n  /** @return {number} */\n  static bar() {\n    return 1;\n  }\n}\n\n/** @const {number} */\nContainer.FOO = 1;\n\nexports = {Container};\n\n\nInstead, export individual constants and functions:\n\n/** @return {number} */\nexports.bar = () => {\n  return 1;\n}\n\n/** @const {number} */\nexports.FOO = 1;\n\n\n5.4.12 Do not define nested namespaces\n\nDo not define a nested type (e.g. class, typedef, enum, interface) on another\nmodule-local name. \n\n// foo.js\ngoog.module('my.namespace');\n\nclass Foo {...}\n\nFoo.Bar = class {...};\n\n/** @enum {number} */\nFoo.Baz = {...};\n\n/** @typedef {{value: number}} */\nFoo.Qux;\n\n/** @interface */\nFoo.Quuz = class {...}\n\nexports.Foo = Foo;\n\n\nThese values should be top-level exports. Choose clear names for these values\n(e.g. FooConverter for a Converter that could have been nested on Foo). However,\nwhen the module name is redundant with part of the class name, consider omitting\nthe redundancy: foo.Foo and foo.Converter rather than foo.Foo and\nfoo.FooConverter. Importers can add the prefix when necessary for clarity\n(e.g. import {Converter as FooConverter} from './foo';) but cannot easily\nremove the redundancy when importing the entire module as a namespace.\n\n// foo.js\ngoog.module('my.namespace');\n\nclass Foo {...}\n\nclass FooBar {...}\n\n/** @enum {string} */\nlet FooBaz = {...};\n\n/** @typedef {{value: number}} */\nlet FooQux;\n\n/** @interface */\nclass FooQuuz {...};\n\nexport = {\n  Foo,\n  FooBar,\n  FooBaz,\n  FooQux,\n  FooQuuz,\n};\n\n\n5.5 Functions\n\n5.5.1 Top-level functions\n\nTop-level functions may be defined directly on the exports object, or else\ndeclared locally and optionally exported. See ??\nfor more on exports.\n\nExamples:\n\n/** @param {string} str */\nexports.processString = (str) => {\n  // Process the string.\n};\n\n\n/** @param {string} str */\nconst processString = (str) => {\n  // Process the string.\n};\n\nexports = {processString};\n\n\n5.5.2 Nested functions and closures\n\nFunctions may contain nested function definitions. If it is useful to give the\nfunction a name, it should be assigned to a local const.\n\n5.5.3 Arrow functions\n\nArrow functions provide a concise function syntax and simplify scoping this\nfor nested functions. Prefer arrow functions over the function keyword for\nnested functions (but see ??).\n\nPrefer arrow functions over other this scoping approaches such as\nf.bind(this), goog.bind(f, this), and const self = this. Arrow functions\nare particularly useful for calling into callbacks as they permit explicitly\nspecifying which parameters to pass to the callback whereas binding will blindly\npass along all parameters.\n\nThe left-hand side of the arrow contains zero or more parameters. Parentheses\naround the parameters are optional if there is only a single non-destructured\nparameter. When parentheses are used, inline parameter types may be specified\n(see ??).\n\nTip: Always using parentheses even for single-parameter arrow functions can\navoid situations where adding parameters, but forgetting to add parentheses, may\nresult in parseable code which no longer works as intended.\n\nThe right-hand side of the arrow contains the body of the function. By default\nthe body is a block statement (zero or more statements surrounded by curly\nbraces). The body may also be an implicitly returned single expression if\neither: the program logic requires returning a value, or the void operator\nprecedes a single function or method call (using void ensures undefined is\nreturned, prevents leaking values, and communicates intent). The single\nexpression form is preferred if it improves readability (e.g., for short or\nsimple expressions).\n\nExamples:\n\n/**\n * Arrow functions can be documented just like normal functions.\n * @param {number} numParam A number to add.\n * @param {string} strParam Another number to add that happens to be a string.\n * @return {number} The sum of the two parameters.\n */\nconst moduleLocalFunc = (numParam, strParam) => numParam + Number(strParam);\n\n// Uses the single expression syntax with `void` because the program logic does\n// not require returning a value.\ngetValue((result) => void alert(`Got ${result}`));\n\nclass CallbackExample {\n  constructor() {\n    /** @private {number} */\n    this.cachedValue_ = 0;\n\n    // For inline callbacks, you can use inline typing for parameters.\n    // Uses a block statement because the value of the single expression should\n    // not be returned and the expression is not a single function call.\n    getNullableValue((/** ?number */ result) => {\n      this.cachedValue_ = result == null ? 0 : result;\n    });\n  }\n}\n\n\nDisallowed:\n\n/**\n * A function with no params and no returned value.\n * This single expression body usage is illegal because the program logic does\n * not require returning a value and we're missing the `void` operator.\n */\nconst moduleLocalFunc = () => anotherFunction();\n\n\n5.5.4 Generators\n\nGenerators enable a number of useful abstractions and may be used as needed.\n\nWhen defining generator functions, attach the * to the function keyword when\npresent, and separate it with a space from the name of the function. When using\ndelegating yields, attach the * to the yield keyword.\n\nExample:\n\n/** @return {!Iterator<number>} */\nfunction* gen1() {\n  yield 42;\n}\n\n/** @return {!Iterator<number>} */\nconst gen2 = function*() {\n  yield* gen1();\n}\n\nclass SomeClass {\n  /** @return {!Iterator<number>} */\n  * gen() {\n    yield 42;\n  }\n}\n\n\n5.5.5 Parameter and return types\n\nFunction parameters and return types should usually be documented with JSDoc\nannotations. See ?? for more information.\n\n5.5.5.1 Default parameters\n\nOptional parameters are permitted using the equals operator in the parameter\nlist. Optional parameters must include spaces on both sides of the equals\noperator, be named exactly like required parameters (i.e., not prefixed with\nopt_), use the = suffix in their JSDoc type, come after required parameters,\nand not use initializers that produce observable side effects. All optional\nparameters for concrete functions must have default values, even if that value\nis undefined. In contrast to concrete functions, abstract and interface\nmethods must omit default parameter values.\n\nExample:\n\n/**\n * @param {string} required This parameter is always needed.\n * @param {string=} optional This parameter can be omitted.\n * @param {!Node=} node Another optional parameter.\n */\nfunction maybeDoSomething(required, optional = '', node = undefined) {}\n\n/** @interface */\nclass MyInterface {\n  /**\n   * Interface and abstract methods must omit default parameter values.\n   * @param {string=} optional\n   */\n  someMethod(optional) {}\n}\n\n\nUse default parameters sparingly. Prefer destructuring (as in\n??) to create readable APIs when there are\nmore than a small handful of optional parameters that do not have a natural\norder.\n\nNote: Unlike Python's default parameters, it is okay to use initializers that\nreturn new mutable objects (such as {} or []) because the initializer is\nevaluated each time the default value is used, so a single object won't be\nshared across invocations.\n\nTip: While arbitrary expressions including function calls may be used as\ninitializers, these should be kept as simple as possible. Avoid initializers\nthat expose shared mutable state, as that can easily introduce unintended\ncoupling between function calls.\n\n5.5.5.2 Rest parameters\n\nUse a rest parameter instead of accessing arguments. Rest parameters are\ntyped with a ... prefix in their JSDoc. The rest parameter must be the last\nparameter in the list. There is no space between the ... and the parameter\nname. Do not name the rest parameter var_args. Never name a local variable or\nparameter arguments, which confusingly shadows the built-in name.\n\nExample:\n\n/**\n * @param {!Array<string>} array This is an ordinary parameter.\n * @param {...number} numbers The remainder of arguments are all numbers.\n */\nfunction variadic(array, ...numbers) {}\n\n\n5.5.6 Generics\n\nDeclare generic functions and methods when necessary with @template TYPE in\nthe JSDoc above the function or method definition.\n\n5.5.7 Spread operator\n\nFunction calls may use the spread operator (...). Prefer the spread operator\nto Function.prototype.apply when an array or iterable is unpacked into\nmultiple parameters of a variadic function. There is no space after the ....\n\nExample:\n\nfunction myFunction(...elements) {}\nmyFunction(...array, ...iterable, ...generator());\n\n\n5.6 String literals\n\n5.6.1 Use single quotes\n\nOrdinary string literals are delimited with single quotes ('), rather than\ndouble quotes (\").\n\nTip: if a string contains a single quote character, consider using a template\nstring to avoid having to escape the quote.\n\nOrdinary string literals may not span multiple lines.\n\n5.6.2 Template literals\n\nUse template literals (delimited with `) over complex string\nconcatenation, particularly if multiple string literals are involved. Template\nliterals may span multiple lines.\n\nIf a template literal spans multiple lines, it does not need to follow the\nindentation of the enclosing block, though it may if the added whitespace does\nnot matter.\n\nExample:\n\nfunction arithmetic(a, b) {\n  return `Here is a table of arithmetic operations:\n${a} + ${b} = ${a + b}\n${a} - ${b} = ${a - b}\n${a} * ${b} = ${a * b}\n${a} / ${b} = ${a / b}`;\n}\n\n\n5.6.3 No line continuations\n\nDo not use line continuations (that is, ending a line inside a string literal\nwith a backslash) in either ordinary or template string literals. Even though\nES5 allows this, it can lead to tricky errors if any trailing whitespace comes\nafter the slash, and is less obvious to readers.\n\nDisallowed:\n\nconst longString = 'This is a very long string that far exceeds the 80 \\\n    column limit. It unfortunately contains long stretches of spaces due \\\n    to how the continued lines are indented.';\n\n\nInstead, write\n\nconst longString = 'This is a very long string that far exceeds the 80 ' +\n    'column limit. It does not contain long stretches of spaces since ' +\n    'the concatenated strings are cleaner.';\n\n\n5.7 Number literals\n\nNumbers may be specified in decimal, hex, octal, or binary. Use exactly 0x,\n0o, and 0b prefixes, with lowercase letters, for hex, octal, and binary,\nrespectively. Never include a leading zero unless it is immediately followed by\nx, o, or b.\n\n5.8 Control structures\n\n5.8.1 For loops\n\nWith ES6, the language now has three different kinds of for loops. All may be\nused, though for-of loops should be preferred when possible.\n\nfor-in loops may only be used on dict-style objects (see\n??), and should not be used to iterate over an\narray. Object.prototype.hasOwnProperty should be used in for-in loops to\nexclude unwanted prototype properties. Prefer for-of and Object.keys over\nfor-in when possible.\n\n5.8.2 Exceptions\n\nExceptions are an important part of the language and should be used whenever\nexceptional cases occur. Always throw Errors or subclasses of Error: never\nthrow string literals or other objects. Always use new when constructing an\nError.\n\nThis treatment extends to Promise rejection values as Promise.reject(obj) is\nequivalent to throw obj; in async functions.\n\nCustom exceptions provide a great way to convey additional error information\nfrom functions. They should be defined and used wherever the native Error type\nis insufficient.\n\nPrefer throwing exceptions over ad-hoc error-handling approaches (such as\npassing an error container reference type, or returning an object with an error\nproperty).\n\n5.8.2.1 Empty catch blocks\n\nIt is very rarely correct to do nothing in response to a caught exception. When\nit truly is appropriate to take no action whatsoever in a catch block, the\nreason this is justified is explained in a comment.\n\ntry {\n  return handleNumericResponse(response);\n} catch (ok) {\n  // it's not numeric; that's fine, just continue\n}\nreturn handleTextResponse(response);\n\n\nDisallowed:\n\n  try {\n    shouldFail();\n    fail('expected an error');\n  } catch (expected) {\n  }\n\n\nTip: Unlike in some other languages, patterns like the above simply don’t work\nsince this will catch the error thrown by fail. Use assertThrows() instead.\n\n5.8.3 Switch statements\n\nTerminology Note: Inside the braces of a switch block are one or more statement\ngroups. Each statement group consists of one or more switch labels (either case\nFOO: or default:), followed by one or more statements.\n\n5.8.3.1 Fall-through: commented\n\nWithin a switch block, each statement group either terminates abruptly (with a\nbreak, return or thrown exception), or is marked with a comment to\nindicate that execution will or might continue into the next statement group.\nAny comment that communicates the idea of fall-through is sufficient (typically\n// fall through). This special comment is not required in the last statement\ngroup of the switch block.\n\nExample:\n\nswitch (input) {\n  case 1:\n  case 2:\n    prepareOneOrTwo();\n  // fall through\n  case 3:\n    handleOneTwoOrThree();\n    break;\n  default:\n    handleLargeNumber(input);\n}\n\n\n5.8.3.2 The default case is present\n\nEach switch statement includes a default statement group, even if it contains\nno code. The default statement group must be last.\n\n5.9 this\n\nOnly use this in class constructors and methods, in arrow functions defined\nwithin class constructors and methods, or in functions that have an explicit\n@this declared in the immediately-enclosing function’s JSDoc.\n\nNever use this to refer to the global object, the context of an eval, the\ntarget of an event, or unnecessarily call()ed or apply()ed functions.\n\n5.10 Equality Checks\n\nUse identity operators (===/!==) except in the cases documented below.\n\n5.10.1 Exceptions Where Coercion is Desirable\n\nCatching both null and undefined values:\n\nif (someObjectOrPrimitive == null) {\n  // Checking for null catches both null and undefined for objects and\n  // primitives, but does not catch other falsy values like 0 or the empty\n  // string.\n}\n\n\n5.11 Disallowed features\n\n5.11.1 with\n\nDo not use the with keyword. It makes your code harder to understand and has\nbeen banned in strict mode since ES5.\n\n5.11.2 Dynamic code evaluation\n\nDo not use eval or the Function(...string) constructor (except for code\nloaders). These features are potentially dangerous and simply do not work in CSP\nenvironments.\n\n5.11.3 Automatic semicolon insertion\n\nAlways terminate statements with semicolons (except function and class\ndeclarations, as noted above).\n\n5.11.4 Non-standard features\n\nDo not use non-standard features. This includes old features that have been\nremoved (e.g., WeakMap.clear), new features that are not yet standardized\n(e.g., the current TC39 working draft, proposals at any stage, or proposed but\nnot-yet-complete web standards), or proprietary features that are only\nimplemented in some browsers. Use only features defined in the current ECMA-262\nor WHATWG standards. (Note that projects writing against specific APIs, such as\nChrome extensions or Node.js, can obviously use those APIs). Non-standard\nlanguage “extensions” (such as those provided by some external transpilers) are\nforbidden.\n\n5.11.5 Wrapper objects for primitive types\n\nNever use new on the primitive object wrappers (Boolean, Number, String,\nSymbol), nor include them in type annotations.\n\nDisallowed:\n\nconst /** Boolean */ x = new Boolean(false);\nif (x) alert(typeof x);  // alerts 'object' - WAT?\n\n\nThe wrappers may be called as functions for coercing (which is preferred over\nusing + or concatenating the empty string) or creating symbols.\n\nExample:\n\nconst /** boolean */ x = Boolean(0);\nif (!x) alert(typeof x);  // alerts 'boolean', as expected\n\n\n5.11.6 Modifying builtin objects\n\nNever modify builtin types, either by adding methods to their constructors or to\ntheir prototypes. Avoid depending on libraries that do this. Note that the\nJSCompiler’s runtime library will provide standards-compliant polyfills where\npossible; nothing else may modify builtin objects.\n\nDo not add symbols to the global object unless absolutely necessary (e.g.\nrequired by a third-party API).\n\n5.11.7 Omitting () when invoking a constructor\n\nNever invoke a constructor in a new statement without using parentheses ().\n\nDisallowed:\n\nnew Foo;\n\n\nUse instead:\n\nnew Foo();\n\n\nOmitting parentheses can lead to subtle mistakes. These two lines are not\nequivalent:\n\nnew Foo().Bar();\nnew Foo.Bar();\n\n\n6 Naming\n\n6.1 Rules common to all identifiers\n\nIdentifiers use only ASCII letters and digits, and, in a small number of cases\nnoted below, underscores and very rarely (when required by frameworks like\nAngular) dollar signs.\n\nGive as descriptive a name as possible, within reason. Do not worry about saving\nhorizontal space as it is far more important to make your code immediately\nunderstandable by a new reader. Do not use abbreviations that are ambiguous or\nunfamiliar to readers outside your project, and do not abbreviate by deleting\nletters within a word.\n\nerrorCount          // No abbreviation.\ndnsConnectionIndex  // Most people know what \"DNS\" stands for.\nreferrerUrl         // Ditto for \"URL\".\ncustomerId          // \"Id\" is both ubiquitous and unlikely to be misunderstood.\n\n\nDisallowed:\n\nn                   // Meaningless.\nnErr                // Ambiguous abbreviation.\nnCompConns          // Ambiguous abbreviation.\nwgcConnections      // Only your group knows what this stands for.\npcReader            // Lots of things can be abbreviated \"pc\".\ncstmrId             // Deletes internal letters.\nkSecondsPerDay      // Do not use Hungarian notation.\n\n\nException: Variables that are in scope for 10 lines or fewer, including\narguments that are not part of an exported API, may use short (e.g. single\nletter) variable names.\n\n6.2 Rules by identifier type\n\n6.2.1 Package names\n\nPackage names are all lowerCamelCase. For example, my.exampleCode.deepSpace,\nbut not my.examplecode.deepspace or\nmy.example_code.deep_space.\n\nException: The package name may conform to TypeScript's path-based pattern. This is\ntypically all lower case with underscores where present in filenames.\n\n6.2.2 Class names\n\nClass, interface, record, and typedef names are written in UpperCamelCase.\nUnexported classes are simply locals: they are not marked @private.\n\nType names are typically nouns or noun phrases. For example, Request,\nImmutableView, or VisibilityMode. Additionally, interface names may\nsometimes be adjectives or adjective phrases instead (for example, Readable).\n\n6.2.3 Method names\n\nMethod names are written in lowerCamelCase. Names for @private methods may\noptionally end with a trailing underscore.\n\nMethod names are typically verbs or verb phrases. For example, sendMessage or\nstop_. Getter and setter methods for properties are never required, but if\nthey are used they should be named getFoo (or optionally isFoo or hasFoo\nfor booleans), or setFoo(value) for setters.\n\nUnderscores may also appear in JsUnit test method names to separate logical\ncomponents of the name. One typical pattern is\ntest<MethodUnderTest>_<state>_<expectedOutcome>, for example\ntestPop_emptyStack_throws. There is no One Correct Way to name test methods.\n\n6.2.4 Enum names\n\nEnum names are written in UpperCamelCase, similar to classes, and should\ngenerally be singular nouns. Individual items within the enum are named in\nCONSTANT_CASE.\n\n6.2.5 Constant names\n\nConstant names use CONSTANT_CASE: all uppercase letters, with words separated\nby underscores. There is no reason for a constant to be named with a trailing\nunderscore, since private static properties can be replaced by (implicitly\nprivate) module locals.\n\n6.2.5.1 Definition of “constant”\n\nEvery constant is a @const static property or a module-local const\ndeclaration, but not all @const static properties and module-local consts\nare constants. Before choosing constant case, consider whether the field really\nfeels like a deeply immutable constant. For example, if any of that instance's\nobservable state can change, it is almost certainly not a constant. Merely\nintending to never mutate the object is generally not enough.\n\nExamples:\n\n// Constants\nconst NUMBER = 5;\n/** @const */ exports.NAMES = goog.debug.freeze(['Ed', 'Ann']);\n/** @enum */ exports.SomeEnum = { ENUM_CONSTANT: 'value' };\n\n// Not constants\nlet letVariable = 'non-const';\n\nclass MyClass {\n  constructor() { /** @const {string} */ this.nonStatic = 'non-static'; }\n};\n/** @type {string} */\nMyClass.staticButMutable = 'not @const, can be reassigned';\n\nconst /** Set<string> */ mutableCollection = new Set();\n\nconst /** MyImmutableContainer<SomeMutableType> */ stillMutable =\n    new MyImmutableContainer(mutableInner);\n\nconst {Foo} = goog.require('my.foo');  // mirrors imported name\n\nconst logger = log.getLogger('loggers.are.not.immutable');\n\n\nConstants’ names are typically nouns or noun phrases.\n\n6.2.5.2 Local aliases\n\nLocal aliases should be used whenever they improve readability over\nfully-qualified names. Follow the same rules as goog.requires\n(??), maintaining the last part of the aliased name.\nAliases may also be used within functions. Aliases must be const.\n\nExamples:\n\nconst staticHelper = importedNamespace.staticHelper;\nconst CONSTANT_NAME = ImportedClass.CONSTANT_NAME;\nconst {assert, assertInstanceof} = asserts;\n\n\n6.2.6 Non-constant field names\n\nNon-constant field names (static or otherwise) are written in lowerCamelCase,\nwith an optional trailing underscore for private fields.\n\nThese names are typically nouns or noun phrases. For example, computedValues\nor index_.\n\n6.2.7 Parameter names\n\nParameter names are written in lowerCamelCase. Note that this applies even if\nthe parameter expects a constructor.\n\nOne-character parameter names should not be used in public methods.\n\nException: When required by a third-party framework, parameter names may\nbegin with a $. This exception does not apply to any other identifiers (e.g.\nlocal variables or properties).\n\n6.2.8 Local variable names\n\nLocal variable names are written in lowerCamelCase, except for module-local\n(top-level) constants, as described above. Constants in function scopes are\nstill named in lowerCamelCase. Note that lowerCamelCase is used\neven if the variable holds a constructor.\n\n6.2.9 Template parameter names\n\nTemplate parameter names should be concise, single-word or single-letter\nidentifiers, and must be all-caps, such as TYPE or THIS.\n\n6.2.10 Module-local names\n\nModule-local names that are not exported are implicitly private. They are not\nmarked @private. This applies to classes, functions, variables, constants,\nenums, and other module-local identifiers.\n\n6.3 Camel case: defined\n\nSometimes there is more than one reasonable way to convert an English phrase\ninto camel case, such as when acronyms or unusual constructs like IPv6 or\niOS are present. To improve predictability, Google Style specifies the\nfollowing (nearly) deterministic scheme.\n\nBeginning with the prose form of the name:\n\n\nConvert the phrase to plain ASCII and remove any apostrophes. For example,\nMüller's algorithm might become Muellers algorithm.\nDivide this result into words, splitting on spaces and any remaining\npunctuation (typically hyphens).\n\nRecommended: if any word already has a conventional camel case\nappearance in common usage, split this into its constituent parts (e.g.,\nAdWords becomes ad words). Note that a word such as iOS is not\nreally in camel case per se; it defies any convention, so this\nrecommendation does not apply.\n\nNow lowercase everything (including acronyms), then uppercase only the first\ncharacter of:\n\n… each word, to yield UpperCamelCase, or\n… each word except the first, to yield lowerCamelCase\n\nFinally, join all the words into a single identifier.\n\n\nNote that the casing of the original words is almost entirely disregarded.\n\nExamples of lowerCamelCase:\n\n\n\n\nProse form\nCorrect\nIncorrect\n\n\n\n\n\nXML HTTP request\nxmlHttpRequest\nXMLHTTPRequest\n\n\nnew customer ID\nnewCustomerId\nnewCustomerID\n\n\ninner stopwatch\ninnerStopwatch\ninnerStopWatch\n\n\nsupports IPv6 on iOS?\nsupportsIpv6OnIos\nsupportsIPv6OnIOS\n\n\nYouTube importer\nyouTubeImporter\nyoutubeImporter*\n\n\n\n\n*Acceptable, but not recommended.\n\nFor examples of UpperCamelCase, uppercase the first letter of each correct\nlowerCamelCase example.\n\nNote: Some words are ambiguously hyphenated in the English language: for example\nnonempty and non-empty are both correct, so the method names checkNonempty\nand checkNonEmpty are likewise both correct.\n\n7 JSDoc\n\nJSDoc is used on all classes, fields, and methods.\n\n7.1 General form\n\nThe basic formatting of JSDoc blocks is as seen in this example:\n\n/**\n * Multiple lines of JSDoc text are written here,\n * wrapped normally.\n * @param {number} arg A number to do something to.\n */\nfunction doSomething(arg) { … }\n\n\nor in this single-line example:\n\n/** @const @private {!Foo} A short bit of JSDoc. */\nthis.foo_ = foo;\n\n\nIf a single-line comment overflows into multiple lines, it must use the\nmulti-line style with /** and */ on their own lines.\n\nMany tools extract metadata from JSDoc comments to perform code validation and\noptimization. As such, these comments must be well-formed.\n\n7.2 Markdown\n\nJSDoc is written in Markdown, though it may include HTML when necessary.\n\nNote that tools that automatically extract JSDoc (e.g. JsDossier) will often\nignore plain text formatting, so if you did this:\n\n/**\n * Computes weight based on three factors:\n *   items sent\n *   items received\n *   last timestamp\n */\n\n\nit would come out like this:\n\nComputes weight based on three factors: items sent items received last timestamp\n\n\nInstead, write a Markdown list:\n\n/**\n * Computes weight based on three factors:\n *\n *  - items sent\n *  - items received\n *  - last timestamp\n */\n\n\n7.3 JSDoc tags\n\nGoogle style allows a subset of JSDoc tags. See\n?? for the complete list. Most tags must\noccupy their own line, with the tag at the beginning of the line.\n\nDisallowed:\n\n/**\n * The \"param\" tag must occupy its own line and may not be combined.\n * @param {number} left @param {number} right\n */\nfunction add(left, right) { ... }\n\n\nSimple tags that do not require any additional data (such as @private,\n@const, @final, @export) may be combined onto the same line, along with an\noptional type when appropriate.\n\n/**\n * Place more complex annotations (like \"implements\" and \"template\")\n * on their own lines. Multiple simple tags (like \"export\" and \"final\")\n * may be combined in one line.\n * @export @final\n * @implements {Iterable<TYPE>}\n * @template TYPE\n */\nclass MyClass {\n  /**\n   * @param {!ObjType} obj Some object.\n   * @param {number=} num An optional number.\n   */\n  constructor(obj, num = 42) {\n    /** @private @const {!Array<!ObjType|number>} */\n    this.data_ = [obj, num];\n  }\n}\n\n\nThere is no hard rule for when to combine tags, or in which order, but be\nconsistent.\n\nFor general information about annotating types in JavaScript see\nAnnotating JavaScript for the Closure Compiler and\nTypes in the Closure Type System.\n\n7.4 Line wrapping\n\nLine-wrapped block tags are indented four spaces. Wrapped description text may\nbe lined up with the description on previous lines, but this horizontal\nalignment is discouraged.\n\n/**\n * Illustrates line wrapping for long param/return descriptions.\n * @param {string} foo This is a param with a description too long to fit in\n *     one line.\n * @return {number} This returns something that has a description too long to\n *     fit in one line.\n */\nexports.method = function(foo) {\n  return 5;\n};\n\n\nDo not indent when wrapping a @desc or @fileoverview description.\n\n\n\nA file may have a top-level file overview. A copyright notice, author information,\nand default visibility level are optional.\nFile overviews are generally recommended whenever a\nfile consists of more than a single class definition. The top level comment is\ndesigned to orient readers unfamiliar with the code to what is in this file. If\npresent, it may provide a description of the file's contents and any\ndependencies or compatibility information. Wrapped lines are not indented.\n\nExample:\n\n/**\n * @fileoverview Description of file, its uses and information\n * about its dependencies.\n * @package\n */\n\n\n\n\nClasses, interfaces and records must be documented with a description and any\ntemplate parameters, implemented interfaces, visibility, or other appropriate\ntags. The class description should provide the reader with enough information to\nknow how and when to use the class, as well as any additional considerations\nnecessary to correctly use the class. Textual descriptions may be omitted on the\nconstructor. When defining a class @constructor and @extends annotations are\nnot used with the class keyword unless it extends a generic class. When\ndefining an @interface or a @record, the @extends annotation is used when\ndefining a subclass and the extends keyword is never used.\n\n/**\n * A fancier event target that does cool things.\n * @implements {Iterable<string>}\n */\nclass MyFancyTarget extends EventTarget {\n  /**\n   * @param {string} arg1 An argument that makes this more interesting.\n   * @param {!Array<number>} arg2 List of numbers to be processed.\n   */\n  constructor(arg1, arg2) {\n    // ...\n  }\n};\n\n/**\n * Records are also helpful.\n * @extends {Iterator<TYPE>}\n * @record\n * @template TYPE\n */\nclass Listable {\n  /** @return {TYPE} The next item in line to be returned. */\n  next() {}\n}\n\n\n7.7 Enum and typedef comments\n\nAll enums and typedefs must be documented with appropriate JSDoc tags\n(@typedef or @enum) on the preceding line. Public enums and typedefs must\nalso have a description. Individual enum items may be documented with a JSDoc\ncomment on the preceding line.\n\n/**\n * A useful type union, which is reused often.\n * @typedef {!Bandersnatch|!BandersnatchType}\n */\nlet CoolUnionType;\n\n\n/**\n * Types of bandersnatches.\n * @enum {string}\n */\nconst BandersnatchType = {\n  /** This kind is really frumious. */\n  FRUMIOUS: 'frumious',\n  /** The less-frumious kind. */\n  MANXOME: 'manxome',\n};\n\n\nTypedefs are useful for defining short record types, or aliases for unions,\ncomplex functions, or generic types. Typedefs should be avoided for record types\nwith many fields, since they do not allow documenting individual fields, nor\nusing templates or recursive references. For large record types, prefer\n@record.\n\n7.8 Method and function comments\n\nIn methods and named functions, parameter and return types must be documented,\neven in the case of same-signature @overrides. The this type should be\ndocumented when necessary. Return type may be omitted if the function has no\nnon-empty return statements.\n\nMethod, parameter, and return descriptions (but not types) may be omitted if\nthey are obvious from the rest of the method’s JSDoc or from its signature.\n\nMethod descriptions begin with a verb phrase that describes what the method\ndoes. This phrase is not an imperative sentence, but instead is written in the\nthird person, as if there is an implied This method ... before it.\n\nIf a method overrides a superclass method, it must include an @override\nannotation. For overridden methods, all @param and @return annotations must\nbe specified explicitly even if no type from the superclass method is refined.\nThis is to align with TypeScript.\n\n/** A class that does something. */\nclass SomeClass extends SomeBaseClass {\n  /**\n   * Operates on an instance of MyClass and returns something.\n   * @param {!MyClass} obj An object that for some reason needs detailed\n   *     explanation that spans multiple lines.\n   * @param {!OtherClass} obviousOtherClass\n   * @return {boolean} Whether something occurred.\n   */\n  someMethod(obj, obviousOtherClass) { ... }\n\n  /**\n   * @param {string} param\n   * @return {string}\n   * @override\n   */\n  overriddenMethod(param) { ... }\n}\n\n/**\n * Demonstrates how top-level functions follow the same rules.  This one\n * makes an array.\n * @param {TYPE} arg\n * @return {!Array<TYPE>}\n * @template TYPE\n */\nfunction makeArray(arg) { ... }\n\n\nIf you only need to document the param and return types of a function, you may\noptionally use inline JSDocs in the function's signature. These inline JSDocs\nspecify the return and param types without tags.\n\nfunction /** string */ foo(/** number */ arg) {...}\n\n\nIf you need descriptions or tags, use a single JSDoc comment above the method.\nFor example, methods which return values need a @return tag.\n\nclass MyClass {\n  /**\n   * @param {number} arg\n   * @return {string}\n   */\n  bar(arg) {...}\n}\n\n\n// Illegal inline JSDocs.\n\nclass MyClass {\n  /** @return {string} */ foo() {...}\n}\n\n/** No function description allowed inline here. */ function bar() {...}\n\nfunction /** Function description is also illegal here. */ baz() {...}\n\n\n\n\nIn anonymous functions annotations are generally optional. If the automatic type\ninference is insufficient or explicit annotation improves readability, then\nannotate param and return types like this:\n\npromise.then(\n    /** @return {string} */\n    (/** !Array<string> */ items) => {\n      doSomethingWith(items);\n      return items[0];\n    });\n\n\nFor function type expressions, see ??.\n\n\n\nProperty types must be documented. The description may be omitted for private\nproperties, if name and type provide enough documentation for understanding the\ncode.\n\nPublicly exported constants are commented the same way as properties.\n\n/** My class. */\nclass MyClass {\n  /** @param {string=} someString */\n  constructor(someString = 'default string') {\n    /** @private @const {string} */\n    this.someString_ = someString;\n\n    /** @private @const {!OtherType} */\n    this.someOtherThing_ = functionThatReturnsAThing();\n\n    /**\n     * Maximum number of things per pane.\n     * @type {number}\n     */\n    this.someProperty = 4;\n  }\n}\n\n/**\n * The number of times we'll try before giving up.\n * @const {number}\n */\nMyClass.RETRY_COUNT = 33;\n\n\n7.10 Type annotations\n\nType annotations are found on @param, @return, @this, and @type tags,\nand optionally on @const, @export, and any visibility tags. Type annotations\nattached to JSDoc tags must always be enclosed in braces.\n\n7.10.1 Nullability\n\nThe type system defines modifiers ! and ? for non-null and nullable,\nrespectively. These modifiers must precede the type.\n\nNullability modifiers have different requirements for different types, which\nfall into two broad categories:\n\n\nType annotations for primitives (string, number, boolean, symbol,\nundefined, null) and literals ({function(...): ...} and {{foo:\nstring...}}) are always non-nullable by default. Use the ? modifier to\nmake it nullable, but omit the redundant !.\nReference types (generally, anything in UpperCamelCase, including\nsome.namespace.ReferenceType) refer to a class, enum, record, or typedef\ndefined elsewhere. Since these types may or may not be nullable, it is\nimpossible to tell from the name alone whether it is nullable or not. Always\nuse explicit ? and ! modifiers for these types to prevent ambiguity at\nuse sites.\n\n\nBad:\n\nconst /** MyObject */ myObject = null; // Non-primitive types must be annotated.\nconst /** !number */ someNum = 5; // Primitives are non-nullable by default.\nconst /** number? */ someNullableNum = null; // ? should precede the type.\nconst /** !{foo: string, bar: number} */ record = ...; // Already non-nullable.\nconst /** MyTypeDef */ def = ...; // Not sure if MyTypeDef is nullable.\n\n// Not sure if object (nullable), enum (non-nullable, unless otherwise\n// specified), or typedef (depends on definition).\nconst /** SomeCamelCaseName */ n = ...;\n\n\nGood:\n\nconst /** ?MyObject */ myObject = null;\nconst /** number */ someNum = 5;\nconst /** ?number */ someNullableNum = null;\nconst /** {foo: string, bar: number} */ record = ...;\nconst /** !MyTypeDef */ def = ...;\nconst /** ?SomeCamelCaseName */ n = ...;\n\n\n7.10.2 Type Casts\n\nIn cases where the compiler doesn't accurately infer the type of an expression,\nand the assertion functions in\ngoog.asserts\ncannot remedy it, it is\npossible to tighten the type by adding a type annotation comment and enclosing\nthe expression in parentheses. Note that the parentheses are required.\n\n/** @type {number} */ (x)\n\n\n7.10.3 Template Parameter Types\n\nAlways specify template parameters. This way compiler can do a better job and it\nmakes it easier for readers to understand what code does.\n\nBad:\n\nconst /** !Object */ users = {};\nconst /** !Array */ books = [];\nconst /** !Promise */ response = ...;\n\n\nGood:\n\nconst /** !Object<string, !User> */ users = {};\nconst /** !Array<string> */ books = [];\nconst /** !Promise<!Response> */ response = ...;\n\nconst /** !Promise<undefined> */ thisPromiseReturnsNothingButParameterIsStillUseful = ...;\nconst /** !Object<string, *> */ mapOfEverything = {};\n\n\nCases when template parameters should not be used:\n\n\nObject is used for type hierarchy and not as map-like structure.\n\n\n7.10.4 Function type expressions\n\nTerminology Note: function type expression refers to a type annotation for\nfunction types with the keyword function in the annotation (see examples\nbelow).\n\nWhere the function definition is given, do not use a function type expression.\nSpecify parameter and return types with @param and @return, or with inline\nannotations (see ??). This includes\nanonymous functions and functions defined and assigned to a const (where the\nfunction jsdoc appears above the whole assignment expression).\n\nFunction type expressions are needed, for example, inside @typedef, @param\nor @return. Use it also for variables or properties of function type, if they\nare not immediately initialized with the function definition.\n\n  /** @private {function(string): string} */\n  this.idGenerator_ = googFunctions.identity;\n\n\nWhen using a function type expression, always specify the return type\nexplicitly. Otherwise the default return type is unknown (?), which leads to\nstrange and unexpected behavior, and is rarely what is actually desired.\n\nBad - type error, but no warning given:\n\n/** @param {function()} generateNumber */\nfunction foo(generateNumber) {\n  const /** number */ x = generateNumber();  // No compile-time type error here.\n}\n\nfoo(() => 'clearly not a number');\n\n\nGood:\n\n/**\n * @param {function(): *} inputFunction1 Can return any type.\n * @param {function(): undefined} inputFunction2 Definitely doesn't return\n *      anything.\n * NOTE: the return type of `foo` itself is safely implied to be {undefined}.\n */\nfunction foo(inputFunction1, inputFunction2) {...}\n\n\n7.10.5 Whitespace\n\nWithin a type annotation, a single space or line break is required after each\ncomma or colon. Additional line breaks may be inserted to improve readability or\navoid exceeding the column limit. These breaks should be chosen and indented\nfollowing the applicable guidelines (e.g. ?? and\n??). No other whitespace is allowed in type\nannotations.\n\nGood:\n\n/** @type {function(string): number} */\n\n/** @type {{foo: number, bar: number}} */\n\n/** @type {number|string} */\n\n/** @type {!Object<string, string>} */\n\n/** @type {function(this: Object<string, string>, number): string} */\n\n/**\n * @type {function(\n *     !SuperDuperReallyReallyLongTypedefThatForcesTheLineBreak,\n *     !OtherVeryLongTypedef): string}\n */\n\n/**\n * @type {!SuperDuperReallyReallyLongTypedefThatForcesTheLineBreak|\n *     !OtherVeryLongTypedef}\n */\n\n\nBad:\n\n// Only put a space after the colon\n/** @type {function(string) : number} */\n\n// Put spaces after colons and commas\n/** @type {{foo:number,bar:number}} */\n\n// No space in union types\n/** @type {number | string} */\n\n\n7.11 Visibility annotations\n\nVisibility annotations (@private, @package, @protected) may be specified\nin a @fileoverview block, or on any exported symbol or property. Do not\nspecify visibility for local variables, whether within a function or at the top\nlevel of a module. @private names may optionally end with an underscore.\n\n8 Policies\n\n8.1 Issues unspecified by Google Style: Be Consistent!\n\nFor any style question that isn't settled definitively by this specification,\nprefer to do what the other code in the same file is already doing. If that\ndoesn't resolve the question, consider emulating the other files in the same\npackage.\n\n8.2 Compiler warnings\n\n8.2.1 Use a standard warning set\n\nAs far as possible projects should use\n--warning_level=VERBOSE.\n\n8.2.2 How to handle a warning\n\nBefore doing anything, make sure you understand exactly what the warning is\ntelling you. If you're not positive why a warning is appearing, ask for help\n.\n\nOnce you understand the warning, attempt the following solutions in order:\n\n\nFirst, fix it or work around it. Make a strong attempt to actually\naddress the warning, or find another way to accomplish the task that avoids\nthe situation entirely.\nOtherwise, determine if it's a false alarm. If you are convinced that\nthe warning is invalid and that the code is actually safe and correct, add a\ncomment to convince the reader of this fact and apply the @suppress\nannotation.\nOtherwise, leave a TODO comment. This is a last resort.\n If you do this, do\nnot suppress the warning. The warning should be visible until it can be\ntaken care of properly.\n\n\n8.2.3 Suppress a warning at the narrowest reasonable scope\n\nWarnings are suppressed at the narrowest reasonable scope, usually that of a\nsingle local variable or very small method. Often a variable or method is\nextracted for that reason alone.\n\nExample\n\n/** @suppress {uselessCode} Unrecognized 'use asm' declaration */\nfunction fn() {\n  'use asm';\n  return 0;\n}\n\n\nEven a large number of suppressions in a class is still better than blinding the\nentire class to this type of warning.\n\n8.3 Deprecation\n\nMark deprecated methods, classes or interfaces with @deprecated annotations. A\ndeprecation comment must include simple, clear directions for people to fix\ntheir call sites.\n\n8.4 Code not in Google Style\n\nYou will occasionally encounter files in your codebase that are not in proper\nGoogle Style. These may have come from an acquisition, or may have been written\nbefore Google Style took a position on some issue, or may be in non-Google Style\nfor any other reason.\n\n8.4.1 Reformatting existing code\n\nWhen updating the style of existing code, follow these guidelines.\n\n\nIt is not required to change all existing code to meet current style\nguidelines. Reformatting existing code is a trade-off between code churn and\nconsistency. Style rules evolve over time and these kinds of tweaks to\nmaintain compliance would create unnecessary churn. However, if significant\nchanges are being made to a file it is expected that the file will be in\nGoogle Style.\nBe careful not to allow opportunistic style fixes to muddle the focus of a\nCL. If you find yourself making a lot of style changes that aren’t critical\nto the central focus of a CL, promote those changes to a separate CL.\n\n\n8.4.2 Newly added code: use Google Style\n\nBrand new files use Google Style, regardless of the style choices of other files\nin the same package.\n\nWhen adding new code to a file that is not in Google Style, reformatting the\nexisting code first is recommended, subject to the advice in\n??.\n\nIf this reformatting is not done, then new code should be as consistent as\npossible with existing code in the same file, but must not violate the style\nguide.\n\n8.5 Local style rules\n\nTeams and projects may adopt additional style rules beyond those in this\ndocument, but must accept that cleanup changes may not abide by these additional\nrules, and must not block such cleanup changes due to violating any additional\nrules. Beware of excessive rules which serve no purpose. The style guide does\nnot seek to define style in every possible scenario and neither should you.\n\n8.6 Generated code: mostly exempt\n\nSource code generated by the build process is not required to be in Google\nStyle. However, any generated identifiers that will be referenced from\nhand-written source code must follow the naming requirements. As a special\nexception, such identifiers are allowed to contain underscores, which may help\nto avoid conflicts with hand-written identifiers.\n\n9 Appendices\n\n9.1 JSDoc tag reference\n\nJSDoc serves multiple purposes in JavaScript. In addition to being used to\ngenerate documentation it is also used to control tooling. The best known are\nthe Closure Compiler type annotations.\n\n9.1.1 Type annotations and other Closure Compiler annotations\n\nDocumentation for JSDoc used by the Closure Compiler is described in\nAnnotating JavaScript for the Closure Compiler and\nTypes in the Closure Type System.\n\n9.1.2 Documentation annotations\n\nIn addition to the JSDoc described in\nAnnotating JavaScript for the Closure Compiler the following tags are common\nand well supported by various documentation generation tools (such as\nJsDossier) for purely documentation purposes.\n\n\n\n9.1.2.1 @author or @owner - Not recommended.\n\nNot recommended.\n\nSyntax: @author username@google.com (First Last)\n\n/**\n * @fileoverview Utilities for handling textareas.\n * @author kuth@google.com (Uthur Pendragon)\n */\n\n\nDocuments the author of a file or the owner of a test, generally only used in\nthe @fileoverview comment. The @owner tag is used by the unit test dashboard\nto determine who owns the test results.\n\n\n\n\n\n9.1.2.2 @bug\n\nSyntax: @bug bugnumber\n\n/** @bug 1234567 */\nfunction testSomething() {\n  // …\n}\n\n/**\n * @bug 1234568\n * @bug 1234569\n */\nfunction testTwoBugs() {\n  // …\n}\n\n\nIndicates what bugs the given test function regression tests.\n\nMultiple bugs should each have their own @bug line, to make searching for\nregression tests as easy as possible.\n\n\n\n\n\n9.1.2.3 @code - Deprecated. Do not use.\n\nDeprecated. Do not use. Use Markdown backticks instead.\n\nSyntax: {@code ...}\n\nHistorically, `BatchItem` was written as\n{@code BatchItem}.\n\n/** Processes pending `BatchItem` instances. */\nfunction processBatchItems() {}\n\n\nIndicates that a term in a JSDoc description is code so it may be correctly\nformatted in generated documentation.\n\n\n\n\n\n9.1.2.4 @desc\n\nSyntax: @desc Message description\n\n/** @desc Notifying a user that their account has been created. */\nexports.MSG_ACCOUNT_CREATED = goog.getMsg(\n    'Your account has been successfully created.');\n\n\n\n\n\n\n9.1.2.5 @link\n\nSyntax: {@link ...}\n\nThis tag is used to generate cross-reference links within generated\ndocumentation.\n\n/** Processes pending {@link BatchItem} instances. */\nfunction processBatchItems() {}\n\n\nHistorical note: @link tags have also been used to create external links in\ngenerated documentation. For external links, always use Markdown's link syntax\ninstead:\n\n/**\n * This class implements a useful subset of the\n * [native Event interface](https://dom.spec.whatwg.org/#event).\n */\nclass ApplicationEvent {}\n\n\n\n\n\n\n9.1.2.6 @see\n\nSyntax: @see Link\n\n/**\n * Adds a single item, recklessly.\n * @see #addSafely\n * @see goog.Collect\n * @see goog.RecklessAdder#add\n */\n\n\nReference a lookup to another class function or method.\n\n\n\n\n\n9.1.2.7 @supported\n\nSyntax: @supported Description\n\n/**\n * @fileoverview Event Manager\n * Provides an abstracted interface to the browsers' event systems.\n * @supported IE10+, Chrome, Safari\n */\n\n\nUsed in a fileoverview to indicate what browsers are supported by the file.\n\n\n\nYou may also see other types of JSDoc annotations in third-party code. These\nannotations appear in the JSDoc Toolkit Tag Reference but are not considered\npart of valid Google style.\n\n9.1.3 Framework specific annotations\n\nThe following annotations are specific to a particular framework.\n\n\n\n9.1.3.1 @ngInject for Angular 1\n\n\n\n\n\n9.1.3.2 @polymerBehavior for Polymer\n\n\n\nhttps://github.com/google/closure-compiler/wiki/Polymer-Pass\n\n\n\n\n\n\n9.1.4 Notes about standard Closure Compiler annotations\n\nThe following tags used to be standard but are now deprecated.\n\n\n\n9.1.4.1 @expose - Deprecated. Do not use.\n\nDeprecated. Do not use. Use @export and/or @nocollapse instead.\n\n\n\n\n\n9.1.4.2 @inheritDoc - Deprecated. Do not use.\n\nDeprecated. Do not use. Use @override instead.\n\n\n\n9.2 Commonly misunderstood style rules\n\nHere is a collection of lesser-known or commonly misunderstood facts about\nGoogle Style for JavaScript. (The following are true statements; this is not a\nlist of myths.)\n\n\nNeither a copyright statement nor @author credit is required in a source\nfile. (Neither is explicitly recommended, either.)\nThere is no hard and fast rule governing how to order the members of a\nclass (??).\nEmpty blocks can usually be represented concisely as {}, as detailed in\n(??).\nThe prime directive of line-wrapping is: prefer to break at a higher\nsyntactic level (??).\nNon-ASCII characters are allowed in string literals, comments and JSDoc, and\nin fact are recommended when they make the code easier to read than the\nequivalent Unicode escape would (??).\n\n\n\n\nThe following tools exist to support various aspects of Google Style.\n\n9.3.1 Closure Compiler\n\nThis program performs type checking and\nother checks, optimizations and other transformations (such as lowering code to\nECMAScript 5).\n\n9.3.2 clang-format\n\nThis program  reformats\nJavaScript source code into Google Style, and also follows a number of\nnon-required but frequently readability-enhancing formatting practices. The\noutput produced by clang-format is compliant with the style guide.\n\n\nclang-format is not required. Authors are allowed to change its output, and\nreviewers are allowed to ask for such changes; disputes are worked out in the\nusual way. However, subtrees may choose to opt in to such enforcement locally.\n\n9.3.3 Closure compiler linter\n\nThis program  checks for a\nvariety of missteps and anti-patterns.\n\n9.3.4 Conformance framework\n\nThe JS Conformance Framework is a tool that is part of the Closure Compiler that\nprovides developers a simple means to specify a set of additional checks to be\nrun against their code base above the standard checks. Conformance checks can,\nfor example, forbid access to a certain property, or calls to a certain\nfunction, or missing type information (unknowns).\n\nThese rules are commonly used to enforce critical restrictions (such as defining\nglobals, which could break the codebase) and security patterns (such as using\neval or assigning to innerHTML), or more loosely to improve code quality.\n\nFor additional information see the official documentation for the\nJS Conformance Framework.\n\n9.4 Exceptions for legacy platforms\n\n9.4.1 Overview\n\nThis section describes exceptions and additional rules to be followed when\nmodern ECMAScript syntax is not available to the code authors. Exceptions to the\nrecommended style are required when modern ECMAScript syntax is not possible and\nare outlined here:\n\n\nUse of var declarations is allowed\nUse of arguments is allowed\nOptional parameters without default values are allowed\n\n\n9.4.2 Use var\n\n9.4.2.1 var declarations are NOT block-scoped\n\nvar declarations are scoped to the beginning of the nearest enclosing\nfunction, script or module, which can cause unexpected behavior, especially with\nfunction closures that reference var declarations inside of loops. The\nfollowing code gives an example:\n\nfor (var i = 0; i < 3; ++i) {\n  var iteration = i;\n  setTimeout(function() { console.log(iteration); }, i*1000);\n}\n\n// logs 2, 2, 2 -- NOT 0, 1, 2\n// because `iteration` is function-scoped, not local to the loop.\n\n\n\n9.4.2.2 Declare variables as close as possible to first use\n\nEven though var declarations are scoped to the beginning of the enclosing\nfunction, var declarations should be as close as possible to their first use,\nfor readability purposes. However, do not put a var declaration inside a block\nif that variable is referenced outside the block. For example:\n\nfunction sillyFunction() {\n  var count = 0;\n  for (var x in y) {\n    // \"count\" could be declared here, but don't do that.\n    count++;\n  }\n  console.log(count + ' items in y');\n}\n\n\n9.4.2.3 Use @const for constants variables\n\nFor global declarations where the const keyword would be used, if it were\navailable, annotate the var declaration with @const instead (this is\noptional for local variables).\n\n9.4.3 Do not use block scoped functions declarations\n\nDo not do this:\n\nif (x) {\n  function foo() {}\n}\n\n\nWhile most JavaScript VMs implemented before ECMAScript 6 support function\ndeclarations within blocks it was not standardized. Implementations were\ninconsistent with each other and with the now-standard ECMAScript behavior for\nblock scoped function declaration. The ECMAScript 5 standard and prior only\nallow for function declarations in the root statement list of a script or\nfunction and explicitly ban them in block scopes in strict mode.\n\nTo get consistent behavior, instead use a var initialized with a function\nexpression to define a function within a block:\n\nif (x) {\n  var foo = function() {};\n}\n\n\n9.4.4 Dependency management with goog.provide/goog.require\n\n9.4.4.1 Summary\n\nWARNING: goog.provide dependency management is deprecated. All new files,\neven in projects using goog.provide for older files, should use\ngoog.module. The following rules are for\npre-existing goog.provide files only.\n\n\nPlace all goog.provides first, goog.requires second. Separate provides\nfrom requires with an empty line.\nSort the entries alphabetically (uppercase first).\nDon't wrap goog.provide and goog.require statements. Exceed 80 columns\nif necessary.\nOnly provide top-level symbols.\n\n\ngoog.provide statements should be grouped together and placed first. All\ngoog.require statements should follow. The two lists should be separated with\nan empty line.\n\nSimilar to import statements in other languages, goog.provide and\ngoog.require statements should be written in a single line, even if they\nexceed the 80 column line length limit.\n\nThe lines should be sorted alphabetically, with uppercase letters coming first:\n\ngoog.provide('namespace.MyClass');\ngoog.provide('namespace.helperFoo');\n\ngoog.require('an.extremelyLongNamespace.thatSomeoneThought.wouldBeNice.andNowItIsLonger.Than80Columns');\ngoog.require('goog.dom');\ngoog.require('goog.dom.TagName');\ngoog.require('goog.dom.classes');\ngoog.require('goog.dominoes');\n\n\n\nAll members defined on a class should be in the same file. Only top-level\nclasses should be provided in a file that contains multiple members defined on\nthe same class (e.g. enums, inner classes, etc).\n\nDo this:\n\ngoog.provide('namespace.MyClass');\n\n\nNot this:\n\ngoog.provide('namespace.MyClass');\ngoog.provide('namespace.MyClass.CONSTANT');\ngoog.provide('namespace.MyClass.Enum');\ngoog.provide('namespace.MyClass.InnerClass');\ngoog.provide('namespace.MyClass.TypeDef');\ngoog.provide('namespace.MyClass.staticMethod');\n\n\nMembers on namespaces may also be provided:\n\ngoog.provide('foo.bar');\ngoog.provide('foo.bar.CONSTANT');\ngoog.provide('foo.bar.method');\n\n\n9.4.4.2 Aliasing with goog.scope\n\nWARNING: goog.scope is deprecated. New files should not use goog.scope\neven in projects with existing goog.scope usage.\n\ngoog.scope may be used to shorten references to namespaced symbols in code\nusing goog.provide/goog.require dependency management.\n\nOnly one goog.scope invocation may be added per file. Always place it in the\nglobal scope.\n\nThe opening goog.scope(function() { invocation must be preceded by exactly one\nblank line and follow any goog.provide statements, goog.require statements,\nor top-level comments. The invocation must be closed on the last line in the\nfile. Append // goog.scope to the closing statement of the scope. Separate the\ncomment from the semicolon by two spaces.\n\nSimilar to C++ namespaces, do not indent under goog.scope declarations.\nInstead, continue from the 0 column.\n\nOnly make aliases for names that will not be re-assigned to another object\n(e.g., most constructors, enums, and namespaces). Do not do this (see below for\nhow to alias a constructor):\n\ngoog.scope(function() {\nvar Button = goog.ui.Button;\n\nButton = function() { ... };\n...\n\n\nNames must be the same as the last property of the global that they are\naliasing.\n\ngoog.provide('my.module.SomeType');\n\ngoog.require('goog.dom');\ngoog.require('goog.ui.Button');\n\ngoog.scope(function() {\nvar Button = goog.ui.Button;\nvar dom = goog.dom;\n\n// Alias new types after the constructor declaration.\nmy.module.SomeType = function() { ... };\nvar SomeType = my.module.SomeType;\n\n// Declare methods on the prototype as usual:\nSomeType.prototype.findButton = function() {\n  // Button as aliased above.\n  this.button = new Button(dom.getElement('my-button'));\n};\n...\n});  // goog.scope\n\n\n9.4.4.3 goog.forwardDeclare\n\nPrefer to use goog.requireType instead of goog.forwardDeclare to break\ncircular dependencies between files in the same library. Unlike goog.require,\na goog.requireType statement is allowed to import a namespace before it is\ndefined.\n\ngoog.forwardDeclare statements must follow the same style rules as\ngoog.require and goog.requireType. The entire block of\ngoog.forwardDeclare, goog.require and goog.requireType statements is\nsorted alphabetically.\n\ngoog.forwardDeclare is used in legacy code to break circular references\nspanning across library boundaries. This pattern however is poorly supported\nby build tools and should not be used. Code should be organized to avoid\ncircular dependencies across libraries (by splitting/merging libraries).\n\n9.4.4.4 goog.module.get(name)\n\nIf a goog.provide file depends on a goog.module file, the goog.provide\nfile can not normally refer to the module's exports via a global name. Instead,\nin addition to goog.require()ing the module, the goog.provide file must\nfetch the module's export object by calling goog.module.get('module.name').\n\nNote: Only calling goog.module.get('module.name') does not create a build-time\ndependency of your code on the module. The goog.require is needed for the\nbuild dependency.\n\n9.4.4.5 goog.module.declareLegacyNamespace()\n\nWARNING: goog.module.declareLegacyNamespace is only for transitional use.\n\ngoog.module.declareLegacyNamespace is only for use while migrating a\nJavaScript file and its consumers from goog.provide to goog.module\n. Update consumers of\nyour goog.module to use goog.module themselves.\nRemove calls to goog.module.declareLegacyNamespace whenever possible.\n\n\nIf you can't update consumers of a legacy namespace from goog.provide to\ngoog.module soon, please wrap the contents of your file in a call to\ngoog.scope, use goog.module.get to import the legacy namespace--and then\ndelete the call to goog.module.declareLegacyNamespace in your goog.module.\n\nCalling goog.module.declareLegacyNamespace() inside a goog.module(name) will\ndeclare the module's namespace as a global name just like a goog.provide()\ncall does. This allows a non goog.module namespace to access the module's\nexports without calling goog.module.get(name).\n\n\n\nEnd of content from https://google.github.io/styleguide/jsguide.html"
    ]
  ],
  "selectionOrder": [
    "url:1731224303522"
  ]
}